import { _decorator, Component, Node, Vec3, resources, JsonAsset, Prefab, instantiate, Label, math, UITransform, EPhysics2DDrawFlags, PhysicsSystem2D, BoxCollider2D, Intersection2D, Mask, Canvas, AudioSource, AudioClip, UIOpacity, tween, Tween, Animation, Enum, Vec2, CCBoolean, ParticleSystem2D, Toggle, sys } from 'cc';
import { Arrow } from './Arrow';
import { Utils } from './CocosUtils';
import { Circle } from './Circle';
import { UIWin } from './UIWin';
import { UISetting } from './UISetting';
import { UISelectLevel } from './UISelectLevel';
import { GuideStep, UIGuide } from '../resources/guide/UIGuide';
import { JsbManager, PlatformType } from './jsb/JSBManager';
import { Obstacle } from './Obstacle';
import { SwitchType } from './jsb/JSB';
import { GlobalConfig } from './CocosGlobalConfig';
import { SqlUtil } from './SqlUtil';
import { ObstacleFish } from './ObstacleFish';
import { UIProtrol } from './UIProtrol';
import { yr } from './android/yr';
const { ccclass, property } = _decorator;

export const isNet = false;

@ccclass('Engine')
export class Engine extends Component {
    private levelDatas: Array<levels> = null;
    public arrows: Arrow[] = [];
    private levelData: levels = null; // 关卡数据
    circles: Circle[] = []; // 存储所有圆点的数组

    @property({
        type: Enum(PlatformType)
    })
    platformType: PlatformType = PlatformType.None;

    @property(Node)
    board: Node;

    @property(Node)
    dir: Node;

    @property(Node)
    mask: Node;

    @property(Canvas)
    canvas: Canvas;

    @property(Prefab)
    circleFab: Prefab;

    @property(Prefab)
    arrowFab: Prefab;

    @property(Node)
    game: Node;

    @property(Node)
    uigame: Node;

    @property(Node)
    uimain: Node;

    @property(Label)
    levelLabel: Label;
    @property(Label)
    mainLabel: Label;


    @property(Node)
    btnRemove: Node;
    @property(Node)
    btnTip: Node;

    @property(Node)
    adTipPlane: Node;

    @property(UISetting)
    setting: UISetting;

    @property(JsonAsset)
    levelDataAsset: JsonAsset;

    // @property(JsonAsset)
    // levelGuideDataAsset: JsonAsset;

    @property(Node)
    tipNode: Node;

    @property([Node])
    adNodes: Array<Node> = [];

    @property
    cellSize: number = 60; // 每个格子的大小为 100x100


    @property(Label)
    timeLabel: Label;

    @property(Node)
    cblNode: Node;

    @property(Node)
    bottomNode: Node;

    @property(Node)
    protrolNode: Node;

    @property(Toggle)
    toggle: Toggle;


    canvasUt: UITransform;

    static instance: Engine;

    curLevel: number;

    musicSource: AudioSource;


    touchId: number = -1;

    records: Array<Arrow | Obstacle> = [];
    obsAry: Array<Obstacle> = [];

    jsb: JsbManager;

    curGuideData: Array<any> = null; // 当前的引导数据
    guides = [];
    isGameOver: boolean = false;

    frogCircles: Array<Circle> = []; // 存储青蛙的圆点的数组
    countDown: number = 0;
    protected onLoad(): void {
        Engine.instance = this;
        this.canvasUt = this.canvas.getComponent(UITransform);
        this.jsb = new JsbManager();
        this.jsb.init(this.platformType);
        this.protrolNode.active = false;
        this.toggle.isChecked = false;
        this.bottomNode.active = isNet == false;
    }

    start() {
        // this.win.hide();
        this.setting.hide();
        this.uigame.active = false;
        // this.hideMask();
        this.musicSource = this.node.addComponent(AudioSource);
        this.musicSource.loop = true;

        this.levelDatas = this.levelDataAsset.json as Array<levels>; // 获取所有关卡数据
        this.tipNode.active = false;
        this.adTipPlane.active = false;
        this.changeAdVisible(false);
        this.playMusic();
        this.jsb.Jsb.initAd();

        GlobalConfig.DB = {
            level: SqlUtil.get('curLevel', 1),
            accid: SqlUtil.get('accid', ''),
            coin: SqlUtil.get('coin', 0),
            nickName: '',
            openid: '',
            avatarUrl: '',
        }

        this.cblNode.active = false;
        this.refreshLevelLabel();

    }

    showCbl() {
        this.cblNode.active = true;
    }

    hideCbl() {
        this.cblNode.active = false;
    }

    showProtrol1() {
        let data = "<p>解压大河马用户注册协议</p><p><br></p><p><br></p><p><br></p><p>发布日期：2026年【4】月【7】日</p><p><br></p><p><br></p><p><br></p><p>生效日期：2026年【4】月【7】日</p><p><br></p><p><br></p><p><br></p><p> 《解压大河马用户注册协议 》是您与解压大河马信息科技有限公司旗下产品解压大河马所达成的协议。在此特别提醒您在注册成为解压大河马用户之前，请认真阅读本《解压大河马用户注册协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。您同意并点击确认本协议条款且完成注册程序后，才能成为解压大河马的正式注册用户，并享受解压大河马的各类服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。若您不同意本协议，或对本协议中的条款存在任何疑问，请您立即停止解压大河马用户注册程序，并可以选择不使用解压大河马服务。请您务必仔细阅读。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>1.用户信息采集</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 当您在本网站/软件进行用户注册登记，使用本网站/软件的服务，以及参加本网站/软件的活动时，即为您同意本网站/软件将收集您的个人信息，并保存记录。本网站/软件收集的个人信息包括但不限于：姓名、性别、生日、城市、身份证号码、电子邮箱地址、手机电话、血型，收货地址等。您主动提供的信息越多及越准确，我们就能够更好地为您提供有关服务。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>2.用户信息的使用</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 本网站/软件收集个人信息的基本目的是为了更好的了解我们的用户，以便向您提供特色服务和个性化服务。个人信息将主要用于以下几个目的：</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（1） 完成您对特定服务或产品的要求。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（2）在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（3）帮助我们设计新服务，改善我们现有服务。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（4）使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（5） 用于对本网站/软件用户数据的统计（如用户数量、构成、兴趣、表现等），以便我们向用户提供更好的服务和产品，或向第三方为了一定的合法目的披露该类统计数据。该类统计数据都是用户群整体的信息，而非个人的信息。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（6）让您参与有关我们产品和服务的调查。为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>3.用户信息的共享和披露</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 解压大河马信息所收集您的个人信息，将仅用于解压大河马为您提供相关服务。一般情况下，在未得到您的同意之前，您的任何个人信息将不会被提供给无关的第三方。在下列情况下，我们可能会将您的个人信息提供给有关的第三方：</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（1）本网站/软件的某些服务需由一个合作伙伴（如代理公司、提供相关技术服务的公司、运输公司、邮寄公司、提供奖品的公司等）提供或共同提供。为了向您提供此类服务，本网站有必要与该合作伙伴分享您的个人信息。如果您不希望您的信息被分享，您可以不使用该具体服务从而拒绝您的个人信息被披露。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（2） 本网站/软件可能会与第三方共同进行推广活动。在推广活动中所收集的全部或部分个人信息可能会与该第三方分享。如果您不想让您的信息被分享，您可以通过不参加该推广活动而拒绝。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（3）根据法律法规或政府的强制性规定，我们必须向有关司法或政府部门门提供您的个人信息。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（4）为了防止他人的合法权益或社会公共利益受到重大危害。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（5）为 了防止您的合法权益受到重大危害。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（6）我们发现您的行为违反了本网站/软件的服务条款或关于特定服务或产品的任何使用指引或对解压大河马信息的合法权益构成重大危害。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>4.用户管理</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 您可以在任何时候通过使用您的本网站/软件的注册用户名和密码，查询，补充或更正您的本网站/软件帐户中的个人信息，或要求删除您的本网站/软件帐户中的个人信息。您在本网站/软件的帐户可以被删除，但这样会导致您不能够登录本网站/软件及使用本网站/软件的任何服务。若发现任何非法使用用户帐号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。因用户未妥善保管其帐号名称及密码而导致第三人使用帐号而给用户造成的损失，由用户自行承担。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 用户在注册及使用时应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，且用户对其发布的内容（包括但不限于文字、图片等）时，不得有以下情形：</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（1）违反宪法或法律法规规定的；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（3）损害国家荣誉和利益的，损害公共利益的；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（9）含有法律、行政法规禁止的其他内容或违反解压大河马的其他规定的。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 用户以虚假信息骗取帐号名称注册，或其帐号头像、简介等注册信息存在违法和不良信息的解压大河马有权采取通知限期改正、暂停使用、注销登记等措施。解压大河马帐号仅限于用户本人使用，严禁将您的解压大河马帐号允许第三人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>5.信息安全</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 您的本网站/软件帐户信息和本网站/软件档案通过密码来保护，只有您个人才有权获取这些个人信息。我们建议您不要向任何他人泄露您的密码。本网站/软件也不会主动致电或主动发电子邮件给您来询问您的密码，如果您遇到此类情况请及时与解压大河马客服联系确认。同时，请您在完成工作后，务必退出您的本网站/软件帐户并关闭您的浏览器窗口，以便当您与他人合用一台电脑，或正在公共场所使用电脑时，保证他人无法获取您的个人信息和往来通信。遗憾的是，任何通过互联网或无线网络的数据传输都无法获得绝对的安全保证。所以，在我们尽最大努力来保护您的个人信息的同时，本网站/软件不能对您向我们进行的信息传输，或我们所发的在线产品或服务的信息的安全作出肯定或保证。您作出上述行为时将自己承担风险。一旦我们收到您传输来的信息，我们将尽最大努力保证其在我们系统的安全。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>6.用户隐私制度</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 我们会在您自愿的前提下收集您的个人信息并将这些信息进行整合，包括但不限于注册帐号时的相关信息和活动报名信息等。尊重用户个人隐私是解压大河马的一项基本政策。所以，解压大河马不会公开或向任何第三方透露用户的注册资料以及用户因享受解压大河马服务而提供的任何信息，但以下情形除外：</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（1）事先获得用户的明确授权或许可；已经征得用户同意的.</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（2）用户在解压大河马自己发布的内容包含个人信息.</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（3）遵守有关法律规定，包括在国家有关机关查询时，提供用户的注册信息、用户在本站发布的信息内容及其发布时间、互联网地址或者域名等；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（4）在紧急情况下竭力维护用户个人和社会大众的隐私安全；</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>（5）根据本条款相关规定或者解压大河马认为必要的其他情形。解压大河马可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与解压大河马同等的保护用户隐私的责任，则解压大河马可将用户信息提供给该第三方。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>7. 所有权及知识产权条款</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 本“网站/软件”由解压大河马拥有和运作。本“网站/软件”公开或显示的所有内容，包括但不限于文字、图表、照片、图像、动画、音效、插图及软件（简称“内容”）等，均属解压大河马及其许可人或内容供应商所有。本“网站/软件”内的所有组成要素，包括但不限于整体设计及“内容”，均受商业外观、版权、道德规范、商标及其它所有相关知识产权的法律保护。除非依据本条款与条件或与经解压大河马在其它协议的声明同意外，本网站/软件內的任何部分或组成要素或“內容”均不得以任何方式复制或传播。除非有明确协议同意，否则网站/软件中的“內容”及一切相关权利将为解压大河马成员或其许可人的资产。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>8.责任限制</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 除非另有明确的书面说明，本站及其所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在’按现状和\"按现有”的基础上提供的。除非另有明确的书面说明，我们不对本站的运营及其包含在本站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。我们不担保本站所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本站发出的电子信件、信息没有病毒或其他有害成分。如因不可抗力或其它本站无法控制的原因使本站服务系统溃或无法正常使用导致服务不可用或网上交易无法完成或丢失有关的信息、记录等，我们会合理地尽力协助处理善后事宜。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>9. 免责声明</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 客户明确同意使用解压大河马服务的风险由客户承担。解压大河马明确表示不提供任何类型的担保，不论是明确的或隐含的。解压大河马将尽力维护客户使用解压大河马服务的合法权益，但不担保解压大河马服务一定.能满足客户的要求，也不担保服务的及时性、安全性、真实性、稳定性、正确性。对客户使用该等服务中出现的信息（包括但不限于客户发布的信息）删除或储存失败，解压大河马亦不承担任何责任。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 客户理解并接受下载或通过相应产品服务取得的任何信息资料取决于客户自己，并自行承担系统受损、资料丢失以及其他任何风险。解压大河马对客户在互联网上得到的任何商品购物服务、交易进程、招聘信息等，都不作担保。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 解压大河马对直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用解压大河马服务及/或应用服务，在网上购买商品或类似服务，在网上进行交易，非法使用服务或客户传送的信息有所变动。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 解压大河马对本项服务下涉及的境内外基础运营商的通信网络的故障、技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、客户所在位置、客户关机或其他非解压大河马技术能力范围内的事因等造成的服务中断、客户邮件内容丢失、出现乱码、错误接收、无法接收、迟延接收不承担责任。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 解压大河马保留判定客户的行为是否符合本服务协议要求的权利，如果客户违背了本服务协议的规定，解压大河马有权中止或终止相应解压大河马服务。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 转户规定：如果客户将手机号码转让给他人，请用户提前自行删除解压大河马内资料。否则，受让该号码的客户将能够查看您的客户个人数据。解压大河马不承担由此引发的客户数据丢失等责任及纠纷。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>10.协议更新及用户关注义务</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 根据国家法律法规的更新及网站运营需要，我们有权对本条款不时地进行修改，修改后的服务条款--旦被张贴在本站上即生效力，并代替原来的服务条款。用户可随时登录查阅最新服务条款内容。如用户不同意更新后的服务条款，应立即停止接受本站提供的服务；如用户继续使用本站提供的服务，即视为同意更新后的用户协议。我们建议您在使用本站之前阅读本用户协议及本站的公告。如果本用户协议中任何一条被视为废止无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余协议的有效性和可执行性。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>11.法律管辖和适用</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 本用户协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行之有效法律。如发生本服务条款的某些内容与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本条款內容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向解压大河马所在地的中华人民共和国大陆地区法院提起诉讼。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>12.其他</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 我们尊重用户和消费者的合法权利，本用户协议及本站上发布的各类规则、政策、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。解压大河马欢迎用户和社会各界提出意见和建议，我们将虚心接受并适时修改本服务条款及相关政策、规则。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p> 您完成注册且成为解压大河马的注册用户则意味着您完全接受本用户协议，在注册之前请您再次确认已知悉并完全理解本用户协议的全部内容。</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p class=\"ql-align-center\"> </p>"
        data = `<color=#000000>${data}</c>`
        this.protrolNode.getComponent(UIProtrol).init("用户协议", data);
    }

    showProtrol2() {
        let data = "<p>更新日期： 2026年04月07日\t</p><p>生效日期： 2026年04月07日\t</p><p>本政策适用于“解压大河马APP”产品或服务（以下简称“本应用”）\t</p><p>本隐私权政策部分将帮助您了解以下内容：\t</p><p>一、定义及适用范围\t</p><p>二、自启动和关联启动的说明\t</p><p>三、我们如何收集和使用您的信息\t</p><p>四、我们如何使用Cookie和同类技术\t</p><p>五、我们如何共享、转让、公开披露用户的个人信息\t</p><p>六、我们如何保护用户的信息安全\t</p><p>七、您如何管理个人信息\t</p><p>八、我们如何处理未成年人的信息\t</p><p>九、您的信息如何在全球范围转移\t</p><p>十、本隐私权政策如何更新\t</p><p>在使用本应用各项产品或服务前，请您务必仔细阅读并透彻理解本政策，在确认充分理解并同意后使用相关产品或服务。一旦您开始使用本应用各项产品或服务，即表示您已充分理解并同意本政策。如对本政策内容有任何疑问、意见或建议，您可通过本应用提供的各种联系方式与我们联系。</p><p>一、定义及适用范围\t</p><p>个人信息：以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反应特定自然人活动情况的各种信息，个人信息包括（姓名、出生日期、身份证件号码、个人生物识别信息、住址、通信通讯联系方式、通信记录和内容、账号密码、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息）等。</p><p>个人敏感信息：一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康收到损害或歧视性待遇等的个人信息，个人敏感信息包括（身份证件号码、个人生物识别信息、银行账户、通信记录和内容、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息、14岁以下（含）儿童的个人信息）等。</p><p>个人信息处理：包括个人信息的收集、存储、使用、加工、传输、提供、公开、删除等。\t</p><p>个人信息删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。\t</p><p>个人信息匿名化：通过对个人信息的技术处理，使得个人信息主体无法被识别或者关联，且处理后的信息不能被复原的过程。\t</p><p>个人信息去标识化：通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别或者关联个人信息主体的过程。\t</p><p>个人信息主体：个人信息所标识或者关联的自然人。\t</p><p>个人信息控制者：有能力决定个人信息处理目的、方式等的组织或个人。\t</p><p>设备信息：包括设备标识符（IMEI、IDFA、Android ID、MAC、OAID、IMSI及其他设备相关信息）、应用信息（应用崩溃信息、通知开关状态、应用安装列表及其他应用相关信息）、设备参数及系统信息（设备类型、设备型号、操作系统及硬件相关信息），设备网络 环境信息（IP地址、WiFi信息，基站信息及其他网络相关信息），以产品实际采集情况为准。同时为保障服务的正常运作，当您使用基于位置的功能时，我们可能会收集您连接的Wi-Fi路由器硬件地址（BSSID）、Wi-Fi网络名称（SSID）及设备IP地址。这些信息经过匿名化处理后，将用于计算近似地理位置，且不会与您的个人身份直接关联。</p><p>儿童：指不满十四周年的未成年人。\t</p><p>二、自启动和关联启动的说明\t</p><p>1、为确保本应用处于关闭或后台运行状态下可正常接收到客户端推送的安装包下载广播信息，本应用须使用(自启动)能力，将存在一定频率通过系统发送广播唤醒本应用自启动或关联启动行为，是因实现功能及服务所必要的。\t</p><p>2、为了带给您更好的应用更新体验，应用引入了网络连接状态监听（android.net.conn.CONNECTIVITY_CHANGE，android.net.wifi.STATE_CHANGE）提醒网络发生变化时，避免产生不必要的流量浪费，同时关联了自启动功能（android.intent.action.DOWNLOAD_COMPLETE，android.intent.action.DOWNLOAD_NOTIFICATION_CLICKED），目的是当应用安装包下载完成时，能即时的提醒您进行安装。</p><p>3、在您未同意用户协议和隐私政策前，若您点击查看用户协议和隐私政策，为防止第三方SDK收集您的个人信息，我们会通过启动系统浏览器来供您查看用户协议和隐私政策。\t</p><p>4、我们的应用集成了微信分享，微信分享完成后回到App显示分享状态，需要重新启动App。我们应用分享出去的链接，在已安装应用时会打开app，为了方便您更便利打开app查看\t</p><p>5、自启动权限：我们的应用为集成极光推送，为方便您快速查看通知内容，我们将会通过通知打开APP，显示通知对应的内容。我们的应用集成了微信支付，微信支付完成后回到APP显示支付状态，需要重新启动APP。为了确保您能及时收取到平台用户发送的消息、留言等相关内容，我们会请求您授权程序自启动权限，此权限使用目的为保证APP退出后台后不及时杀死APP在后台运行状态，以确保您能及时收取到应用内的消息。您如果拒绝授权提供程序自启动权限，您将无法使用此功能，但不影响您正常使用APP。</p><p>三、我们如何收集和使用您的信息\t</p><p>在您使用我们的产品/服务时，我们需要收集和使用您的个人信息包括如下两种：\t</p><p>1、为实现向您提供我们产品/或服务的基本功能，您须授权我们收集、使用的必要的信息，如您拒绝提供相应信息，您将无法正常使用我们的产品及/或服务；\t</p><p>2、为实现向您提供我们产品及/或服务的附加功能，您可选择单独同一或不同意我们收集、使用的信息，如您拒绝提供，您将无法正常使用相关附加功能或无法达到我们拟达到的功能效果，不会影响您使用我们的基本功能。\t</p><p>3、在为你提供同城频道内容或者与设备所在位置相关的内容或服务时，经过你的授权， 我们会使用与本服务相关的地理位置信息（如精确定位信息、WLAN接入点、蓝牙和基站、传感器信息），以保障内容或服务的质量。其中精确定位信息是个人敏感信息，若你拒绝授权位置权限会影响定位的准确性，但不会影响其他功能与服务的正常使用，我们也仅会基于网络信息（如IP）对应的城市及/或区县向你展示可能相关的内容或服务。</p><p>4、在您使用App时，会获取方向传感器、陀螺仪设备传感器信息，用于鉴别您是否为真实用户。在您使用录像照相相关功能时，会获取加速度设备传感器信息，用于获取拍摄手机角度。\t</p><p>5、剪切板权限：您在使用过程中可能需要对文字进行复制并粘贴时（如：短信验证码、手机号、设备SN等），我们可能会申请调用剪切板复制/粘贴功能并收集您的设备剪切板中的文字信息。剪切板的信息仅会在您的设备上进行处理，我们不会存储您的剪切板信息用于其他途径。</p><p>我们在此特别提醒您：这些信息并非该业务功能运行所必需，但这些信息对改善服务质量、研发新产品或服务等有非常重要的意义。我们不会强制要求您提供这些信息，您如果拒绝不会对使用该业务功能产生不利影响。\t</p><p>我们为您提供的各项具体功能场景包括：\t</p><p>1、帮助您成为我们的用户\t</p><p>为完成创建账号，以便我们为您提供服务，您需提供以下信息：您的手机号码等信息。当您注册时向我们提供注册所用的手机号码(用于接收验证码)，我们将通过发送短信验证码来验证您的身份是否有效。您可以修改补充您的昵称、性别、生日、头像、实名验证绑定以及您的支付宝账号、微信账户(用于账户提现)等相关信息，这些信息均属于您的“账户信息”。当您使用第三方账号(微信账号、Apple账号)登录时，如果您决定绑定该第三方平台的账号，经过您的第三方平台账号绑定授权，第三方平台会同步一部分您在该第三方平台账号下的相关信息给我们，如用户名、手机号、头像、昵称、地区、性别等(具体以您的授权为准)以及身份验证信息。我们收集上述信息是用于为您提供账号登录服务以及保障您的账户安全，防范安全风险。</p><p>如果您拒绝授权上述信息，您将无法使用第三方平台的账号登录本应用平台，但不影响我们为您提供的其他产品和正常使用其他服务。\t</p><p>在使用过程中，如果您提供以下额外信息补全个人资料，将有助于我们给您提供更好的服务和体验：您的生日、职业、兴趣、手机号码。但如果您不提供这些信息，将不会影响使用本应用产品或服务的基本功能。\t</p><p>您提供的上述信息将在您使用本服务期间持续授权我们使用。在您主动申请注销账号时，我们将根据适用法律法规的要求尽快使其匿名或删除您的个人信息。\t</p><p>2、为您提供服务和需求\t</p><p>为向您展示内容或服务，我们会收集和使用您在访问或使用本网站或客户端时的设备信息（包括设备标识符（IMEI、IDFA、Android ID、MAC、OAID、IMSI及其他设备相关信息）、应用信息（应用崩溃信息、通知开关状态、应用安装列表及其他应用相关信息）、设备参数及系统信息（设备类型、设备型号、操作系统及硬件相关信息），设备网络环境信息(IP地址、WiFi信息、基站信息及其他网络相关信息））、服务日志信息（浏览记录、点击查看记录、搜索查询记录、收藏、关注分享信息、发布信息、以及IP地址、浏览器类型、电信运营商、使用语言、访问日期和时间）、您提交的基础信息（如昵称、性别、手机号），用来完善您的个人信息。</p><p>3、向您提供商品或服务\t</p><p>3.1 您向我们提供的信息\t</p><p>您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如微信基本信息（昵称、头像、性别）、电话号码等；\t</p><p>您通过我们服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。向本应用提供该其他方的前述个人信息之前，您需确保您已经取得其授权同意。\t</p><p>3.2 我们在您使用服务过程中收集的信息\t</p><p>为向您提供搜索结果、了解产品适配性、识别账号异常状态，我们会收集关于您使用的服务以及使用方式的信息并将这些信息进行关联，这些信息包括：\t</p><p>3.2.1 设备信息：\t</p><p>为了保障应用与服务的安全运行，我们会收集您的设备型号、应用列表（安装列表）、设备名称、设备唯一标识符、登录IP地址、产品版本号、移动网络信息。\t</p><p>我们将在静默/后台状态中收集您的（设备标识符、设备序列号、Android ID、应用列表、IMEI、IDFA、MAC、姓名、手机号、位置）等信息，用于识别用户的身份信息。\t</p><p>3.2.2 服务日志信息：包括浏览记录、点击查看记录、搜索查询记录、收藏、交易、售后、关注分享信息、发布信息、以及IP地址、浏览器类型、电信运营商、使用语言、访问日期和时间。\t</p><p>当您使用我们的网站或客户端提供的产品或服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的搜索查询内容、Idiv地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间及您访问的网页记录等。\t</p><p>请注意，单独的设备信息、日志信息等是无法识别特定自然人身份的信息。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。</p><p>当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。\t</p><p>3.3 我们通过间接获得方式收集到的您的个人信息\t</p><p>您可通过本应用账号在我们提供的链接入口使用我们关联公司提供的产品或服务，为便于我们基于关联账号共同向您提供一站式服务并便于您统一进行管理，我们在本应用集中展示您的信息。您可以通过个人中心的基础信息和认证信息等功能发现、使用上述服务。</p><p>当您通过我们产品或服务使用上述服务时，您授权我们根据实际业务及合作需要从我们关联公司处接收、汇总、分析我们确认其来源合法或您授权同意其向我们提供的您的个人信息或活动信息。\t</p><p>如您拒绝提供上述信息或拒绝授权，可能无法正常使用本应用的相应产品或服务，或者无法展示相关信息，但不影响使用本应用浏览、参与部分不需要隐私授权的活动等核心服务。\t</p><p>4、为您提供安全保障\t</p><p>请注意，为确保用户身份真实性、向您提供更好的安全保障，您可以向我们提供身份证等身份信息完成实名认证。如您拒绝提供上述信息，可能无法使用账户管理、继续可能存在风险的交易等服务，但不会影响您使用浏览、购买商品等服务。\t</p><p>为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或本应用相关协议规则的情况，我们可能使用或整合您的用户信息、交易信息、设备信息、有关网络日志以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。</p><p>5、为您提供收藏、关注与分享功能\t</p><p>在您浏览我们网站或客户端的过程中，您可以选择对商品及/或服务进行收藏、通过我们提供的功能组件向其他第三方分享信息。在您使用上述功能的过程中，我们会收集包括您的收藏及获取优惠券信息的记录、分享历史在内的服务日志信息用于实现上述功能及其他我们明确告知的目的。</p><p>6、征得授权同意的例外\t</p><p>根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：\t</p><p>6.1 与个人信息控制者履行法律法规规定的义务相关的；\t</p><p>6.2 与国家安全、国防安全直接相关的；\t</p><p>6.3 与公共安全、公共卫生、重大公共利益直接相关的；\t</p><p>6.4 与刑事侦查、起诉、审判和判决执行等直接相关的；\t</p><p>6.5 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；\t</p><p>6.6 所涉及的个人信息是个人信息主体自行向社会公众公开的；\t</p><p>6.7 根据个人信息主体要求签订和履行合同所必需的；\t</p><p>6.8 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；\t</p><p>6.9 维护所提供产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；\t</p><p>6.10 个人信息控制者为新闻单位，且其开展合法的新闻报道所必需的；\t</p><p>6.11 个人信息控制者为学术研究机构，处理公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的。\t</p><p>如我们停止运营本应用产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。\t</p><p>7、客服与售后功能\t</p><p>当您与我们联系或提出售中售后、争议纠纷处理申请时，为了保障您的账户及系统安全，我们需要您提供必要的个人信息以核验您的会员身份。此时我们的客服和售后功能可能会使用您的账号信息和订单信息。\t</p><p>为便于与您联系、尽快帮助您解决问题或记录相关问题的处理方案及结果，我们可能会保存您与我们的通信/通话记录及相关内容(包括账号信息、订单信息、您为了证明相关事实提供的其他信息，或您留下的联系方式信息)，如果您针对具体订单进行咨询、投诉或提供建议的，我们会使用您的账号信息和订单信息。</p><p>为了提供服务及改进服务质量的合理需要，我们还可能使用的您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息。\t</p><p>四、我们如何使用Cookie和同类技术\t</p><p>1、Cookie\t</p><p>Cookie和同类设备信息标识技术是互联网中普遍使用的技术，当您使用我们的服务时，我们可能会使用相关技术向您的设备发送一个或多个Cookie或匿名标识符（以下简称“Cookie”），以收集、标识和存储您访问、使用本产品时的信息，我们承诺，不会将Cookie用于本隐私政策所述目的之外的任何其他用途，我们使用Cookie主要为了保障产品与服务的安全、高效运转，可以使我们确认您账户与交易的安全状态，排查崩溃、延迟的相关异常情况，帮助您省去重复您填写表单、输入搜索内容的步骤和流程。</p><p>2、网站信标和像素标签\t</p><p>除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。</p><p>五、我们如何共享、转让、公开披露用户的个人信息\t</p><p>1、共享\t</p><p>我们不会与本应用服务提供者以外的公司、组织和个人共享您的个人信息，但以下情况除外：\t</p><p>1.1 在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。\t</p><p>1.2 在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。\t</p><p>1.3 与关联公司间共享：为便于我们基于关联账号共同向您提供服务，您的个人信息可能会与我们的关联公司共享。我们只会共享必要的个人信息（如为便于您使用本应用账号使用我们关联公司产品或服务，我们会向关联公司共享您必要的账户信息），如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。</p><p>1.4 与授权合作伙伴共享：仅为实现本隐私权政策中声明的目的，我们的某些服务将由我们和授权合作伙伴共同提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如安排合作伙伴提供服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于与产品或服务无关的其他用途。</p><p>请注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至敏感个人信息，请您更加谨慎地考虑并做出决定。\t</p><p>目前，我们的授权合作伙伴包括以下类型：\t</p><p>1.4.1 广告、分析服务类的授权合作伙伴。除非得到您的许可，否则我们不会将您的个人身份信息（指可以识别您身份的信息，例如姓名或电子邮箱、手机号码，通过这些信息可以联系到您或识别您的身份）与提供广告、分析服务的合作伙伴共享。我们会向这些合作伙伴提供有关其广告覆盖面和有效性的信息，而不会提供您的个人身份信息，或者我们将这些信息进行汇总，以便它不会识别您个人。例如，只有在广告主同意遵守我们的广告发布准则后，我们才可能会告诉广告主他们广告的效果如何，或者有多少人看了他们广告或在看到广告后安装了应用，或者向这些合作伙伴提供不能识别个人身份的统计信息（例如“男性，25-29岁，位于北京”），帮助他们了解其受众或顾客。</p><p>1.4.2 供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务、支付便利或进行学术研究和调查。</p><p>1.4.3 为了向您提供一键分享服务，我们的产品集成友盟+ U-Share SDK，将收集您的设备标识信息（如IMEI/android ID/IDFA等）和您需要分享的社交账户公开信息，以便完成一键分享服务。为了您的信息安全，我们已与第三方SDK服务商进行数据安全保密约定，这些公司会严格遵守我们的数据隐私和安全要求。除非得到您的同意，我们不会与其共享您的个人身份信息。为便于您更好地了解【友盟+】采集的数据类型及用途，以及何保护您的个人信息，您可以登陆【友盟+】隐私政策了解【友盟+】隐私权政策。</p><p>1.4.4 为实现广告投放、数据统计等功能，我们可能会集成第三方服务商提供的软件开发工具包（SDK）。以下是穿山甲 SDK（所属公司：北京巨量引擎网络技术有限公司）收集的信息及用途说明：1. 收集的信息类型设备标识符：OAID（开放匿名标识符）：用于安卓设备的广告归因、用户行为分析及广告精准投放，替代传统 IMEI 以保护用户隐私。Android ID：用于设备识别，辅助广告投放和反作弊监测。应用安装列表：获取您设备上已安装的应用程序列表，用于广告定向（如根据已安装应用推断用户兴趣）或避免重复展示相同广告。设备传感器信息：当您使用与传感器相关的游戏功能（如重力感应、陀螺仪操作）时，SDK 可能收集加速度计、陀螺仪、磁场传感器等数据，用于优化游戏交互体验或广告互动逻辑。其他设备信息：包括设备型号、系统版本、IP 地址、屏幕尺寸、网络环境（WIFI/4G 等）、设备存储权限（用于缓存广告素材）等，用于保障 SDK 的正常运行和广告展示适配。信息使用目的信息使用目的游戏功能优化：基于传感器数据优化游戏操作灵敏度或交互逻辑（如体感控制功能）。安全与反作弊：通过设备标识符和安装列表监测异常操作，防范外挂或非法程序。授权与同意穿山甲 SDK 的初始化及数据收集需基于您的授权同意。当您首次使用游戏内广告相关功能（如观看激励视频、接收横幅广告）时，我们会通过弹窗或提示引导您选择是否允许 SDK 收集相关信息。若您拒绝授权，可能影响广告展示效果或部分依赖传感器的游戏功能，但不影响游戏核心玩法（如单机模式）。穿山甲 SDK 收集的信息将存储于其服务器中，我们仅根据合作需要获取经去标识化处理的统计数据，不会直接访问您的原始个人信息第三方 SDK 会采取加密传输、访问控制等安全措施保护数据，并遵守《个人信息保护法》《广告法》等法律法规要求。</p><p>对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的数据保护协定，要求他们按照我们的说明、本隐私权政策以及其他任何相关的保密和安全措施来处理个人信息。\t</p><p>集成SDK服务及权限使用说明\t</p><p>SDK名称：友盟+SDK\t</p><p>公司名称：友盟同欣（北京）科技有限公司\t</p><p>服务类型：U-APP（应用数据统计）进行APP运营统计与分析，U-APM（应用性能监测），U-Share（应用内容分享）\t</p><p>收集个人信息类型：设备Mac地址和设备型号信息，获取设备序列号，唯一设备识别码(IMEI/MEC/AndroidID/IDF-A/0AID/0PenUDID/GUID/SIM卡IMSI/ICCID)、无线网SSID名称、WiFi路由器MAC地址（BSSID）；电信运营商；用户的手机号码和地理位置；获取设备传感器；已安装APP信息、传感器信息、剪切板\t</p><p>使用目的：存储备份崩溃日志，进行崩溃分析、兼容性分析、性能监测。\t</p><p>官网/隐私政策链接：https://www.umeng.com/page/policy\t</p><p>SDK名称：穿山甲广告SDK（巨量、穿山甲引擎）\t</p><p>公司名称：北京巨量引擎网络技术有限公司\t</p><p>服务类型：广告投放、广告监测归因、反作弊、广告投放统计分析、减少APP崩溃、提供稳定可靠的服务\t</p><p>权限：IP地址、运营商信息、Wi-Fi状态、网络信号强度、应用包名、运行中的进程信息、版本号、应用前后台状态、加速度传感器、陀螺仪传感器、线性加速度传感器、磁场传感器、旋转矢量传感器\t</p><p>收集数据类型：设备标识符IMEI、IMSI、ICCID、GAID、OAID；设备品牌、名称、型号；设备IP、UA、MAC地址、、MEID、设备序列号build_serial、WIFI SSID/BSSID、Android ID。\t</p><p>使用目的：广告投放及广告监测归因、反作弊。\t</p><p>官网/隐私政策链接：https://www.csjplatform.com/privacy\t</p><p>2、转让\t</p><p>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：\t</p><p>2.1 在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；\t</p><p>2.2 在涉及合并、收购或破产清算时，如涉及个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此个人信息保护政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。\t</p><p>3、公开披露\t</p><p>我们会在以下情况下，公开披露您的个人信息：\t</p><p>3.1 获得您明确同意后；\t</p><p>3.2 基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。\t</p><p>4、共享、转让、公开披露个人信息时事先征得授权同意的例外\t</p><p>以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：\t</p><p>4.1 与个人信息控制者履行法律法规规定的义务相关的；\t</p><p>4.2 与国家安全、国防安全直接相关的；\t</p><p>4.3 与公共安全、公共卫生、重大公共利益直接相关的；\t</p><p>4.4 与刑事侦查、起诉、审判和判决执行等直接相关的；\t</p><p>4.5 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；\t</p><p>4.6 个人信息主体自行向社会公众公开的个人信息；\t</p><p>4.7 从合法公开披露的信息中心收集个人信息的，如合法的新闻报道、政府信息公开等渠道。\t</p><p>根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。\t</p><p>六、我们如何保护用户的信息安全\t</p><p>1、我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与服务器之间交换数据（如信用卡信息）时受 SSL（Secure Socket Layer）协议加密保护(即HTTPS协议)；我们会使用加密技术提高个人信息的安全性；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。</p><p>2、我们有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。\t</p><p>3、我们会采取合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。\t</p><p>4、互联网并非绝对安全的环境，我们强烈建议您不要使用非本应用建议的通信方式发送个人信息。您可以通过我们的服务建立联系和相互分享。当您通过我们的服务创建交流、交易或分享时，您可以自主选择沟通、交易或分享的对象，作为能够看到您的交易内容、联络方式、交流信息或分享内容等相关信息的第三方。</p><p>如您发现自己的个人信息尤其是您的账户或密码发生泄露，请您立即联络本应用客服，以便我们根据您的申请采取相应措施。\t</p><p>请注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息，如您在发表动态或者在群聊天、圈子等公众场合选择上传包含个人信息的图片。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。</p><p>请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。\t</p><p>七、您如何管理个人信息\t</p><p>您可以通过以下方式查阅和管理您的信息，我们会在符合法律法规要求的情形下响应您的请求：\t</p><p>1、访问您的个人信息\t</p><p>您有权访问您的个人信息，法律法规规定的例外情况除外。您可以通过以下方式自行访问您的个人信息：\t</p><p>个人资料——如果您希望访问或编辑您个人资料中的出生年月日、职业、兴趣爱好以及手机号码其他资料等，您可以通过登录账户通过“我的”-“设置”中执行此类操作。\t</p><p>授权使用——您可以登录账号通过点击右上角“设置”图标，点击“头像”-“设置”，在授权选项中关闭或启用授权。\t</p><p>2、更正或补充您的个人信息\t</p><p>当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正或补充。您可以通过本条“（一）访问您的个人信息”中列明的方式提出更正或补充申请。\t</p><p>3、删除您的个人信息\t</p><p>您可以通过本条“（一）访问您的个人信息”中列明的方式删除您的部分个人信息。\t</p><p>在以下情形中，您可以通过客服向我们提出删除个人信息的请求：\t</p><p>3.1 如果我们处理个人信息的行为违反法律法规；\t</p><p>3.2 如果我们收集、使用您的个人信息，却未征得您的明确同意；\t</p><p>3.3 如果我们处理个人信息的行为严重违反了与您的约定；\t</p><p>3.4 如果您不再使用我们的产品或服务，或您注销了账号；\t</p><p>3.5 如果我们不在为您提供产品或服务。\t</p><p>若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，并要求其及时删除（除法律法规另有规定，或这些主体已独立获得您的授权）。\t</p><p>当您或我们协助您删除相关信息后，因为使用的法律和安全技术限制，我们可能无法立即备份从备份系统之删除响应的信息，我们将安全地存储您的个人信息并限制对其的任何进一步的处理，直到备份可以清楚或实现匿名化。\t</p><p>4、改变您授权同意的范围\t</p><p>每个业务能需要一些基本的个人信息才能得以完成（见本隐私权政策“第一条”）。除此之外，对于额外个人信息的收集和使用，您可以联系本应用客服申请给予或收回您的授权同意。\t</p><p>请注意，对于部分类型的个人信息，如实现本应用基本功能所必须的信息或者我们履行法律法规规定的义务所必须的信息，我们可能无法响应您改变授权范围的请求。当您撤回授权后，我们将不再处理相应的个人信息，但您撤回授权的决定，不会影响我们此前基于您的授权而开展的个人信息处理。</p><p>5、约束信息系统自动决策\t</p><p>在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您可以通过客服联系我们。\t</p><p>6、响应您的上述请求\t</p><p>为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。\t</p><p>我们将在30天内做出答复。如您不满意，还可以通过本应用客服发起投诉。\t</p><p>对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。</p><p>在以下情形中，按照法律法规要求，我们将无法响应您的请求：\t</p><p>6.1 与个人信息控制者履行法律法规规定的义务相关的；\t</p><p>6.2 与国家安全、国防安全直接相关的；\t</p><p>6.3 与公共安全、公共卫生、重大公共利益直接相关的；\t</p><p>6.4 与刑事侦查、起诉、审判和执行判决等直接相关的；\t</p><p>6.5 个人信息控制者有充分证据标明个人信息主体存在主管恶意或滥用权利的；\t</p><p>6.6 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的。\t</p><p>6.7 相应个人信息主体的请求将导致个人信息主体或其他个人、组织的合法权益收到严重损害的；\t</p><p>6.8 涉及商业秘密的。\t</p><p>7、账号注销\t</p><p>我们会保留您账户上的数据（180天），如您不希望继续使用我们的产品，您可以通过：我的-设置-账号注销 向我们提交注销账号的申请。\t</p><p>在您主动注销账户之后，我们将停止为您提供产品或服务，并根据适用法律的要求删除或匿名化处理您的个人信息，因法律法规规定需要留存的除外。\t</p><p>如果您无法通过上述路径访问该等个人信息，您可以随时通过本应用客服与我们取得联系。我们将在15天内回复您的访问请求。\t</p><p>对于您在使用我们的产品或服务过程中产生的其他个人信息，我们将根据本条“（七）响应您的上述请求”中的相关安排向您提供。\t</p><p>八、我们如何处理未成年人的信息\t</p><p>在数字化办公/学习、沟通与协同活动中我们推定您具有相应的民事行为能力，如您为未成年人，我们要求您请您的父母或其他监护人仔细阅读本政策，并在征得您的父母或其他监护人同意的前提下使用我们的服务或向我们提供信息。\t</p><p>如果您是14周岁以下儿童的，在您使用我们的服务前，您和您的监护人应仔细阅读本隐私政策内容，确保在取得监护人的同意后，您才可在监护人的指导下使用我们的服务，确保您在使用我们的服务和进行交易时的安全。\t</p><p>若您是儿童的父母或其他监护人，请您关注儿童是否是在取得您的授权同意之后使用我们的服务，如您对儿童的个人信息有疑问，请与我们的个人信息保护专职部门联系。\t</p><p>对于经父母或监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。\t</p><p>九、您的信息如何在全球范围转移\t</p><p>我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内，以下情形除外：\t</p><p>9.1 法律法规有明确规定；\t</p><p>9.2 获得您的明确授权；\t</p><p>9.3 您通过互联网进行跨境直播/发布动态等个人主动行为。\t</p><p>针对以上情形，我们会确保依据本隐私权政策对您的个人信息提供足够的保护。\t</p><p>十、本隐私权政策如何更新\t</p><p>为给您带来更好的产品和服务体验，我们持续努力改进我们的产品、服务和技术，在新的服务及业务流程变更时，我们可能会更新我们的隐私政策已告知您按照本政策所享有的权利。\t</p><p>对于重大变更，我们还会提供更为显著的通知（包括我们会通过小红点进行通知或向您提供弹窗提示），\t</p><p>未经您明确同意，我们不会削减您按照本个人信息保护政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。\t</p><p>对于重大变更，我们还会提供更为显著的通知（包括对于某些服务，我们会通过电子邮件发送通知，说明个人信息保护政策的具体变更内容）。\t</p><p>本政策所指的重大变更包括但不限于：\t</p><p>1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；\t</p><p>2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更；\t</p><p>3、个人信息共享、转让或公开披露的主要对象发生变化；\t</p><p>4、您参与个人信息处理方面的权利及其行使方式发生重大变化；\t</p><p>5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；\t</p><p>6、个人信息安全影响评估报告标明存在高风险时；\t</p><p>我们还会将本政策的旧版本在本应用专门页面存档，供您查阅。\t</p>"
        data = `<color=#000000>${data}</c>`
        this.protrolNode.getComponent(UIProtrol).init("隐私政策", data);
    }

    goCbl() {
        let that = this;
        // @ts-ignore
        tt.navigateToScene({
            scene: "sidebar",
            success: (res) => {
                console.log("侧边栏打开成功");
                that.hideCbl();
            },
            fail: (res) => {
                console.log("侧边栏打开失败: ", res);
            },
        });

    }


    refreshLevelLabel() {
        //从本地获取当前的关卡
        this.mainLabel.string = GlobalConfig.DB.level.toString();
    }

    loadLevelData(lv: number) {
        this.generateLevel(lv);
    }

    generateLevel(lv: number) {
        this.levelData = this.levelDatas.find(p => p.id == lv);
        if (!this.levelData) {
            console.error('Invalid level data or level name.');
            return;
        }
        this.clearArrowTip();
        this.curGuideData = JSON.parse(this.levelData.guide) || [];
        // console.log(JSON.stringify(this.curGuideData));
        this.isGameOver = false;
        this.records = [];
        this.guides = [];
        this.frogCircles = [];
        const cols = this.levelData.cols || []; // 每列的点数
        const scale = this.levelData.layoutscale || 1; // 父节点缩放
        this.game.setScale(this.levelData.scale, this.levelData.scale, 1)
        // 设置棋盘缩放
        this.board.setScale(scale, scale, 1);

        // 清空棋盘上的子节点
        this.board.removeAllChildren();
        this.arrows = []; // 清空箭头数组
        /**
         * 创建格子
         */
        this.createGrids(cols); // 创建格子
        // 初始化箭头
        const info = JSON.parse(this.levelData.pigs) || []; // 假设 `pigs_xy` 是箭头的初始位置
        info.forEach((info: Array<number>) => {
            this.createArrow(info[0], info[1], info[2], true);
        });

        let obs = JSON.parse(this.levelData.obs) || [];
        for (let o of obs) {
            resources.load("prefabs/" + o[2], Prefab, (err, fab) => {
                if (err) {
                    console.error(err);
                    return;
                }
                const scale = this.levelData.layoutscale || 1; // 父节点缩放
                let c = this.board.children[o[0]];
                const pointNode = instantiate(fab);
                this.dir.addChild(pointNode);
                pointNode.setPosition(c.getPosition().multiplyScalar(scale))
                pointNode.angle = o[1];
                let obs = pointNode.getComponent(Obstacle);
                obs.init(o[0], true);
                this.obsAry.push(obs); // 将障碍物添加到数组中
            })
        }


        this.levelLabel.string = lv.toString();
        this.hideMask();


        if (lv > 2) {
            // this.countDown = 10;
            this.countDown = 300;
            this.timeLabel.node.parent.active = true;
        } else {
            this.timeLabel.node.parent.active = false;
        }


        if (GlobalConfig.DB.level == 1) {
            let isguide = localStorage.getItem('guide1');
            if (isguide != null && isguide != '') {
                return;
            }
            let cellSize = this.cellSize; // 每个格子的大小为 100x100

            let steps: Array<GuideStep> = []
            //查找10的位置
            let grid = this.board.children[10];
            let grid2 = this.board.children[5];
            steps.push(
                {
                    path: 'SpriteSplash',
                    text: '若前方无任何遮挡 /n 可点击小狗直接离开',
                    root: grid,
                    func: () => {
                        this.dir.getChildByName("arrow_6").getComponent(Arrow).move(null);
                    },
                    radius: 200
                },
                {
                    path: 'SpriteSplash',
                    text: '若前方挡住时 /n 可拖动小狗旋转离开',
                    // root: grid2,
                    pos: grid2.getWorldPosition().subtract(new Vec3(cellSize, 0, 0)),
                    radius: 200,
                    initFunc: (node: Node) => {
                        let a = this.dir.getChildByName("arrow_0");
                        let ta = a.getComponent(Arrow);
                        let arrow = this.createArrow(0, a.angle, ta.width, false);
                        arrow.node.name = 'guideArrow'
                        arrow.node.setWorldPosition(a.getWorldPosition());
                        let op = arrow.node.addComponent(UIOpacity);
                        op.opacity = 255 * 0.5;
                        tween(arrow.node).to(0.5, {
                            angle: 0
                        }).delay(0.5).call(() => {
                            arrow.node.angle = a.angle;
                        }).union().repeatForever().start();

                        // //手指的动作
                        let handParent = node.getChildByName('clickBtn');
                        handParent.getComponent(Animation).stop();
                        let hand = handParent.children[0];

                        let pos1 = this.board.children[2].getWorldPosition();
                        hand.setWorldPosition(pos1);
                        let pos2 = this.board.children[9].getWorldPosition();
                        tween(hand).to(0.5, {
                            worldPosition: pos2.clone()
                        }).delay(0.5).call(() => {
                            hand.setWorldPosition(pos1)
                        }).union().repeatForever().start();
                    },
                    touchFunc: (e) => {
                        let a = this.dir.getChildByName("arrow_0");
                        a.emit(Node.EventType.TOUCH_START, e);
                    },

                    moveFunc: (e) => {
                        let a = this.dir.getChildByName("arrow_0");
                        a.emit(Node.EventType.TOUCH_MOVE, e);
                    },

                    endFunc: (e, node: Node) => {
                        let a = this.dir.getChildByName("arrow_0");
                        a.emit(Node.EventType.TOUCH_END, e);
                        let com = a.getComponent(Arrow);
                        if (com.isOver) {
                            // node.destroy();
                            UIGuide.guide.close();

                            this.clearArrowTip();
                            localStorage.setItem('guide1', '1');
                        }
                    }
                }
            )
            UIGuide.create(steps)
        }

        // console.log(this.curGuideData.length, this.arrows.length);

    }

    createGrids(cols: number[]) {
        //格子x间隔
        let cellSizeX = this.levelData.cellSizeX || this.cellSize; // 每个格子的大小为 100x100
        //格子y间隔
        let cellSizeY = this.levelData.cellSizeY || this.cellSize; // 每个格子的大小为 100x100

        // 计算最大行数
        const maxRows = Math.max(...cols);

        // for (let colIndex = 0; colIndex < cols.length; colIndex++) {
        //     // 计算当前列的水平位置
        //     const colX = (colIndex - (cols.length - 1) / 2) * cellSizeX; // 水平位置，保持水平间隔一致
        //     // 当前列的点数
        //     const numPoints = cols[colIndex]; // 当前列的点数

        //     // 垂直分布在中间
        //     const offsetY = (numPoints - 1) * cellSizeX / 2; // 垂直偏移量，保持垂直间隔一致

        //     // 遍历每列的点
        //     for (let rowIndex = 0; rowIndex < numPoints; rowIndex++) {

        //         // 计算点的垂直位置
        //         // const posY = rowIndex * cellSizeY - offsetY; // 垂直位置，保持垂直间隔一致

        //         // this.createGridPoint(colX, posY);
        //         //计算点的垂直位置
        //         const posY = rowIndex * cellSizeY - offsetY; // 垂直位置，保持垂直间隔一致

        //         this.createGridPoint(colX, posY);

        //     }

        // }

        for (let colIndex = 0; colIndex < cols.length; colIndex++) {
            const colX = (colIndex - (cols.length - 1) / 2) * cellSizeX;
            const numPoints = cols[colIndex];

            for (let rowIndex = 0; rowIndex < numPoints; rowIndex++) {
                // 让每列的点以 y=0 为中心对称分布
                let posY = 0;
                if (numPoints % 2 === 1) {
                    // 奇数个点，中间点在 y=0
                    posY = (rowIndex - Math.floor(numPoints / 2)) * cellSizeY;
                } else {
                    // 偶数个点，中间两个点对称分布在 y=0 上下
                    posY = (rowIndex - (numPoints / 2 - 0.5)) * cellSizeY;
                }
                this.createGridPoint(colX, posY);
            }
        }
    }

    createGridPoint(x: number, y: number) {
        const pointNode = instantiate(this.circleFab);
        pointNode.setPosition(new Vec3(x, y, 0));
        let com = pointNode.getComponent(Circle);
        this.board.addChild(pointNode);
        com.init(pointNode.getSiblingIndex()); // 初始化圆点
        this.circles.push(com); // 将圆点添加到数组中

        // pointNode.getChildByName("Label").active = HTML5 ? true : false;
        pointNode.getChildByName("Label").active = false;
    }

    createArrow(slibling: number, angle: number, width: number, put: boolean) {
        const scale = this.levelData.layoutscale || 1; // 父节点缩放

        const arrowNode = instantiate(this.arrowFab);
        let p = this.board.children[slibling];
        if (!p) return null;

        arrowNode.setPosition(p.getPosition().multiplyScalar(scale))
        // arrowNode.setRotationFromEuler(0, 0, this.getRotationFromDirection(direction));
        this.dir.addChild(arrowNode);
        arrowNode.name = `arrow_${slibling}`; // 设置箭头的名称
        let arrow = arrowNode.getComponent(Arrow);
        arrow.index = slibling;
        if (put) {
            this.arrows.push(arrow);
        }

        arrow.init(angle, width, slibling, put); // 初始化箭头
        return arrow;
    }

    checkFutureCollision(arrow: Arrow, targetAngle: number): Arrow | Obstacle {
        // 模拟箭头旋转到目标角度
        const originalAngle = arrow.node.angle;
        arrow.node.angle = targetAngle;

        // 获取旋转后的顶点
        const futureVertices = Utils.getRotatedVecticesArrow(arrow);

        // 恢复原始角度
        arrow.node.angle = originalAngle;

        if (!futureVertices) return null;

        // 遍历所有箭头，检测是否发生碰撞
        for (const otherArrow of this.arrows) {
            if (otherArrow === arrow) continue; // 跳过自身
            if (otherArrow.isOver) continue;

            const otherVertices = Utils.getRotatedVecticesArrow(otherArrow);
            if (!otherVertices) continue;

            if (Intersection2D.polygonPolygon(futureVertices, otherVertices)) {
                // console.log(`Collision detected between ${arrow.node.name} and ${otherArrow.node.name}`);
                return otherArrow; // 检测到碰撞
            }
        }

        for (const obs of this.obsAry) {
            if (obs.isOver) continue;
            const otherVertices = Utils.getRotatedVecticesArrow(obs);
            if (!otherVertices) continue;

            if (Intersection2D.polygonPolygon(futureVertices, otherVertices)) {
                // console.log(`Collision detected between ${arrow.node.name} and ${otherArrow.node.name}`);
                return obs; // 检测到碰撞
            }
        }

        return null; // 没有碰撞

    }

    getFarthestCircle(arrow: Arrow): Circle {
        let farthestCircle: Circle = null;
        let maxDistance = -Infinity;

        const arrowPos = arrow.node.getWorldPosition();

        // 遍历所有圆点，计算距离
        for (const circle of Engine.instance.circles) { // 假设 `Engine` 中有所有圆点的引用

            if (Engine.instance.checkFutureCircleCollision(arrow, circle)) {
                let c = false;
                //获取当前圆形是否与别的矩形由碰撞------ 没有才继续计算
                for (const otherArrow of this.arrows) {
                    if (otherArrow == arrow) continue; // 跳过自身
                    if (Engine.instance.checkFutureCircleCollision(otherArrow, circle)) {
                        //如果这个圆形与别的矩形发生碰撞 则跳过检测
                        c = true;
                        break;
                    }
                }

                if (c) {
                    continue; // 跳过与其他箭头发生碰撞的圆点
                }

                const circlePos = circle.node.getWorldPosition();
                const distance = Vec3.distance(arrowPos, circlePos);
                if (distance == 0) {
                    continue; // 如果距离为0，跳过
                }
                if (distance > maxDistance) {
                    maxDistance = distance;
                    farthestCircle = circle;
                }
            }
        }

        return farthestCircle;
    }

    getPointCircle(pos: Vec3): Circle {
        for (const circle of this.circles) {
            const circlePos = circle.node.getWorldPosition();
            const distance = Vec3.distance(pos, circlePos);
            let radius = this.levelData.radius || 30;
            // if (this.levelData.radius == 2) {
            //     if (distance < 50) {
            //         return circle; // 返回碰撞的圆点
            //     }
            // } else {
            if (distance < radius) {
                return circle; // 返回碰撞的圆点
            }
            // }
        }
        return null; // 没有碰撞
    }

    checkArrowCollision(arrow: Arrow): Arrow {
        for (const otherArrow of this.arrows) {
            if (arrow == otherArrow) continue; // 跳过自身
            if (otherArrow.isOver) continue;
            if (this.checkArrowIsCollison(arrow, otherArrow)) {
                return otherArrow; // 返回碰撞的箭头
            }
        }
        return null;
    }

    /**
     * 检测两个箭头是否发生碰撞
     * @param arrow1 箭头1
     * @param arrow2 箭头2
     * @returns 
     */
    checkArrowIsCollison(arrow1: Arrow, arrow2: Arrow): boolean {
        let vertices1 = Utils.getRotatedVecticesArrow(arrow1);
        let vertices2 = Utils.getRotatedVecticesArrow(arrow2);
        if (Intersection2D.polygonPolygon(vertices1, vertices2)) {
            return true; // 返回碰撞的箭头
        }
        return false; // 没有碰撞
    }

    checkFutureCircleCollision(arrow: Arrow, circle: Circle): boolean {
        // 获取箭头的旋转后的顶点
        const futureVertices = Utils.getRotatedVecticesArrow(arrow);
        if (!futureVertices) return null;

        const circlePos = new math.Vec2(circle.node.getWorldPosition().x, circle.node.getWorldPosition().y); // 圆点的世界坐标
        const circleRadius = 30; // 圆点的半径

        // 检测圆点与箭头的碰撞
        if (Intersection2D.polygonCircle(futureVertices, circlePos, circleRadius)) {
            // console.log(`Collision detected between ${arrow.node.name} and ${circle.node.name}`);
            return true; // 检测到碰撞
        }
        return false; // 没有碰撞
    }

    getCircleArrow(circle: Circle): Arrow {
        let _otherArrow: Arrow = null;
        const circleRadius = 30; // 圆点的半径  
        const circlePos = circle.node.getWorldPosition();
        for (const otherArrow of this.arrows) {
            if (otherArrow.isOver) continue;
            let distance = Vec3.distance(circlePos, otherArrow.node.getWorldPosition());
            if (distance < circleRadius) {
                _otherArrow = otherArrow;
                break;
            }
        }
        return _otherArrow;
    }

    getCircleCollisons(circle: Circle): Arrow | Obstacle {
        const circlePos = new math.Vec2(circle.node.getWorldPosition().x, circle.node.getWorldPosition().y); // 圆点的世界坐标
        const circleRadius = 30; // 圆点的半径
        for (const otherArrow of this.arrows) {
            if (otherArrow.isOver) continue;
            const vertices = Utils.getRotatedVecticesArrow(otherArrow);
            if (Intersection2D.polygonCircle(vertices, circlePos, circleRadius)) {
                return otherArrow; // 检测到碰撞
            }
        }

        for (const obs of this.obsAry) {
            if (obs.isOver) continue;
            const vertices = Utils.getRotatedVecticesArrow(obs);
            if (Intersection2D.polygonCircle(vertices, circlePos, circleRadius)) {
                return obs; // 检测到碰撞
            }
        }
        return null; // 没有碰撞
    }

    checkCircleIsCollisonArrow(arrow: Arrow, circle: Circle) {
        const circlePos = new math.Vec2(circle.node.getWorldPosition().x, circle.node.getWorldPosition().y); // 圆点的世界坐标
        const circleRadius = 30; // 圆点的半径
        for (const otherArrow of this.arrows) {
            if (arrow == otherArrow) continue; // 跳过自身
            if (otherArrow.isOver) continue;
            const vertices = Utils.getRotatedVecticesArrow(otherArrow);
            if (Intersection2D.polygonCircle(vertices, circlePos, circleRadius)) {
                return otherArrow; // 检测到碰撞
            }
        }
        return null; // 没有碰撞
    }

    canMoveTowardsHighlightedCircleOld(arrow: Arrow, highlightedCircle: Circle, first: boolean): Arrow {
        if (!highlightedCircle) return null;

        const arrowPos = arrow.node.getWorldPosition();
        const circlePos = highlightedCircle.node.getWorldPosition();
        // 计算箭头朝小球方向的单位向量
        const direction = new Vec3(circlePos.x - arrowPos.x, circlePos.y - arrowPos.y, 0).normalize();

        const targetPos = new Vec3(
            arrowPos.x + direction.x * 1000, // 假设移动到足够远的位置
            arrowPos.y + direction.y * 1000
        );
        let _otherArrow: Arrow = null;

        for (const circle of this.circles) {
            if (circle == highlightedCircle) continue; // 跳过自身
            const circlePos = circle.node.getWorldPosition();
            const circleRadius = 30; // 圆点的半径  
            //计算当前方向的线段与圆点的碰撞

            if (Utils.lineCircle(new math.Vec2(arrowPos.x, arrowPos.y), new math.Vec2(targetPos.x, targetPos.y), new math.Vec2(circlePos.x, circlePos.y), circleRadius)) {
                // console.log("碰撞到圆点不能移动----------------");
                // return circle; // 返回碰撞的圆点
                //获取当前点上的箭头
                for (const otherArrow of this.arrows) {
                    if (arrow == otherArrow) continue; // 跳过自身
                    if (otherArrow.isOver) continue;

                    if (this.checkFutureCircleCollision(otherArrow, circle)) {
                        // return otherArrow; // 返回碰撞的箭头
                        if (_otherArrow == null) {
                            _otherArrow = otherArrow;
                        } else {
                            //计算距离
                            let d1 = Vec3.distance(arrow.circleNode.getWorldPosition(), otherArrow.circleNode.getWorldPosition());
                            let d2 = Vec3.distance(arrow.circleNode.getWorldPosition(), _otherArrow.circleNode.getWorldPosition());
                            if (d2 > d1) {
                                _otherArrow = otherArrow;
                            }
                        }
                        if (first) {
                            break;
                        }
                    }
                }
            }
            if (first) {
                if (_otherArrow) {
                    break;
                }
            }
        }

        return _otherArrow;
    }

    canMoveTowardsHighlightedCircle(arrow: Arrow, angle: number, first: boolean): Arrow | Obstacle {
        if (!arrow) return null;

        // const arrowPos = arrow.node.getWorldPosition();
        //将角度转换为方向
        const direction = Utils.getDirectionFromRotation(angle).normalize();
        const lineStart1 = new Vec2(arrow.points[0].getWorldPosition().x, arrow.points[0].getWorldPosition().y);
        const lineStart2 = new Vec2(arrow.points[1].getWorldPosition().x, arrow.points[1].getWorldPosition().y);
        const lineEnd1 = new Vec2(lineStart1.x + direction.x * 1000, lineStart1.y + direction.y * 1000);
        const lineEnd2 = new Vec2(lineStart2.x + direction.x * 1000, lineStart2.y + direction.y * 1000);
        const lineStart = new Vec2(arrow.node.getWorldPosition().x, arrow.node.getWorldPosition().y);
        const lineEnd = new Vec2(lineStart.x + direction.x * 1000, lineStart.y + direction.y * 1000);


        //先计算当前方向的线段与圆点的碰撞
        //计算当前方向的线段与圆点的碰撞
        let _otherArrow: Arrow = null;
        const circleRadius = 30; // 圆点的半径  
        for (const circle of this.circles) {
            const circlePos = circle.node.getWorldPosition();
            //计算当前方向的线段与圆点的碰撞
            if (Utils.lineCircle(lineStart, lineEnd, new math.Vec2(circlePos.x, circlePos.y), circleRadius)) {
                //检测圆点上是否存在箭头
                for (const otherArrow of this.arrows) {
                    if (arrow == otherArrow) continue; // 跳过自身
                    if (otherArrow.isOver) continue;
                    let distance = Vec3.distance(arrow.circleNode.getWorldPosition(), otherArrow.circleNode.getWorldPosition());
                    if (distance < circleRadius) {
                        if (!first) {
                            if (_otherArrow == null) {
                                _otherArrow = otherArrow;
                            } else {
                                //计算距离
                                let d1 = Vec3.distance(arrow.circleNode.getWorldPosition(), otherArrow.circleNode.getWorldPosition());
                                let d2 = Vec3.distance(arrow.circleNode.getWorldPosition(), _otherArrow.circleNode.getWorldPosition());
                                if (d2 > d1) {
                                    _otherArrow = otherArrow;
                                }
                            }
                        } else {
                            _otherArrow = otherArrow;
                            break;
                        }
                    }
                }
            }
            if (first) {
                if (_otherArrow) {
                    break;
                }
            }
        }

        //计算当前方向线段碰撞到的所有箭头
        for (const otherArrow of this.arrows) {
            if (arrow == otherArrow) continue; // 跳过自身
            if (otherArrow.isOver) continue;

            const vertices = Utils.getRotatedVecticesArrow(otherArrow);
            let isCollison: boolean = false;
            if (Intersection2D.linePolygon(lineStart1, lineEnd1, vertices)) {
                isCollison = true;

            } else if (Intersection2D.linePolygon(lineStart2, lineEnd2, vertices)) {
                isCollison = true;
            }
            if (isCollison) {
                // console.log("碰撞到箭头不能移动----------------", otherArrow.node.name);
                // return otherArrow; // 返回碰撞的箭头
                if (_otherArrow == null) {
                    _otherArrow = otherArrow;
                } else {
                    //计算距离
                    let d1 = Vec3.distance(arrow.circleNode.getWorldPosition(), otherArrow.circleNode.getWorldPosition());
                    let d2 = Vec3.distance(arrow.circleNode.getWorldPosition(), _otherArrow.circleNode.getWorldPosition());
                    if (d2 > d1) {
                        _otherArrow = otherArrow;
                    }
                }

                if (first) {
                    break;
                }
            }
        }


        if (first) {
            if (_otherArrow) {
                return _otherArrow;
            }
        }
        let _obs: Obstacle = null;
        //计算当前方向线段碰撞到的所有障碍物
        for (const obs of this.obsAry) {
            if (obs.isOver) continue;
            const vertices = Utils.getRotatedVecticesArrow(obs);
            let isCollison: boolean = false;
            if (Intersection2D.linePolygon(lineStart1, lineEnd1, vertices)) {
                // _otherArrow = obs; // 返回碰撞的箭头
                isCollison = true;
            } else if (Intersection2D.linePolygon(lineStart2, lineEnd2, vertices)) {
                // _otherArrow = obs; // 返回碰撞的箭头
                //break;
                isCollison = true;
            }
            if (isCollison) {
                // console.log("碰撞到箭头不能移动----------------", otherArrow.node.name);
                // return otherArrow; // 返回碰撞的箭头
                if (_obs == null) {
                    _obs = obs;
                } else {
                    //计算距离
                    let d1 = Vec3.distance(arrow.circleNode.getWorldPosition(), obs.node.getWorldPosition());
                    let d2 = Vec3.distance(arrow.circleNode.getWorldPosition(), _obs.node.getWorldPosition());
                    if (d2 > d1) {
                        _obs = obs;
                    }
                }

                if (first) {
                    break;
                }
            }
        }

        if (_otherArrow && _obs) {
            let d1 = Vec3.distance(arrow.circleNode.getWorldPosition(), _otherArrow.node.getWorldPosition());
            let d2 = Vec3.distance(arrow.circleNode.getWorldPosition(), _obs.node.getWorldPosition());
            if (d1 > d2) {
                return _obs;
            } else {
                return _otherArrow;
            }
        } else if (_obs) {
            return _obs;
        }
        return _otherArrow;
    }

    /**
     * 查看箭头是否可以放置在当前圆点上
     * @param arrow 箭头
     * @param highlightedCircle 高亮点
     */
    canPutArrow(arrow: Arrow, highlightedCircle: Circle): Arrow | Obstacle {
        if (!highlightedCircle) return null;

        const circlePos = highlightedCircle.node.getWorldPosition();
        const circleRadius = 30; // 圆点的半径

        //查看当前是否会碰撞到其他的箭头

        let arrowVertices = Utils.getRotatedVecticesArrow(arrow);

        for (const otherArrow of this.arrows) {
            if (arrow == otherArrow) continue; // 跳过自身
            if (otherArrow.isOver) continue;

            const vertices = Utils.getRotatedVecticesArrow(otherArrow);
            if (Intersection2D.polygonCircle(vertices, new math.Vec2(circlePos.x, circlePos.y), circleRadius)) {
                return otherArrow; // 返回碰撞的箭头
            }

            if (Intersection2D.polygonPolygon(arrowVertices, vertices)) {
                return otherArrow; // 返回碰撞的箭头
            }
        }

        //查看当前是否会碰撞到其他的障碍物
        for (const obs of this.obsAry) {
            if (obs.isOver) continue; // 跳过自身
            const vertices = Utils.getRotatedVecticesArrow(obs);
            if (Intersection2D.polygonCircle(vertices, new math.Vec2(circlePos.x, circlePos.y), circleRadius)) {
                return obs; // 返回碰撞的箭头
            }

            if (Intersection2D.polygonPolygon(arrowVertices, vertices)) {
                return obs; // 返回碰撞的箭头
            }
        }

        return null; // 没有碰撞
    }

    /**
     * 检测当前角度是否可以移动出去
     * @param arrow 箭头
     * @param highlightedCircle 元旦
     * @returns 
     */
    canMoveTowardArrow(arrow: Arrow, highlightedCircle: Circle): Arrow | Obstacle {
        if (!highlightedCircle) return null;

        const arrowPos = new math.Vec2(arrow.node.worldPosition.x, arrow.node.worldPosition.y);
        const circlePos = highlightedCircle.node.getWorldPosition();
        // 计算箭头朝小球方向的单位向量
        const direction = new math.Vec2(circlePos.x - arrowPos.x, circlePos.y - arrowPos.y).normalize();

        const targetPos = new math.Vec2(
            arrowPos.x + direction.x * 1000, // 假设移动到足够远的位置
            arrowPos.y + direction.y * 1000
        );

        for (const otherArrow of this.arrows) {
            if (arrow == otherArrow) continue;
            if (otherArrow.isOver) continue;


            if (Intersection2D.linePolygon(arrowPos, targetPos, Utils.getRotatedVecticesArrow(otherArrow))) {
                return otherArrow;
            }
        }

        for (const obs of this.obsAry) {
            if (obs.isOver) continue;
            if (Intersection2D.linePolygon(arrowPos, targetPos, Utils.getRotatedVecticesArrow(obs))) {
                return obs;
            }
        }


        return null;
    }

    /**
     * 圆点是否已经被箭头碰撞
     * @param arrow 箭头
     * @param highlightedCircle 高亮的圆点
     * @returns 
     */
    canMoveTowardCircle(arrow: Arrow | Obstacle, highlightedCircle: Circle) {
        if (!highlightedCircle) return null;

        const circlePos = highlightedCircle.node.getWorldPosition();

        for (const otherArrow of this.arrows) {
            if (arrow == otherArrow) continue;
            if (otherArrow.isOver) continue;

            const vertices = Utils.getRotatedVecticesArrow(otherArrow);

            if (Intersection2D.polygonCircle(vertices, new Vec2(circlePos.x, circlePos.y), 30)) {
                return otherArrow;
            }
        }

        return null;
    }

    /**
     * 查看当前障碍物是否可以从当前方向移动出去
     * @param obs 障碍物
     * @param angle 角度
     * @returns 
     */
    canMoveTowardObs(obs: Obstacle, angle: number): Arrow | Obstacle {
        if (!obs) return null;
        const obsPos = obs.node.getWorldPosition();
        const direction = Utils.getDirectionFromRotation(angle).normalize();
        const lineStart = new Vec2(obsPos.x, obsPos.y);
        const lineEnd = new Vec2(lineStart.x + direction.x * 1000, lineStart.y + direction.y * 1000);
        //获取最近的物体

        let _otherArrow: Arrow = null;
        let _obs: Obstacle = null;
        //检测是否与箭头发生碰撞
        for (const otherArrow of this.arrows) {
            if (otherArrow.isOver) continue;
            if (Intersection2D.linePolygon(lineStart, lineEnd, Utils.getRotatedVecticesArrow(otherArrow))) {

                if (_otherArrow == null) {
                    _otherArrow = otherArrow;
                } else {
                    //计算距离
                    let d1 = Vec3.distance(obs.node.getWorldPosition(), otherArrow.node.getWorldPosition());
                    let d2 = Vec3.distance(obs.node.getWorldPosition(), _otherArrow.node.getWorldPosition());
                    if (d2 > d1) {
                        _otherArrow = otherArrow;
                    }
                }
            }
        }

        //检测是否与障碍物发生碰撞
        for (const otherObs of this.obsAry) {
            if (obs == otherObs) continue; // 跳过自身
            if (otherObs.isOver) continue;
            if (Intersection2D.linePolygon(lineStart, lineEnd, Utils.getRotatedVecticesArrow(otherObs))) {
                if (_obs == null) {
                    _obs = otherObs;
                } else {
                    //计算距离
                    let d1 = Vec3.distance(obs.node.getWorldPosition(), otherObs.node.getWorldPosition());
                    let d2 = Vec3.distance(obs.node.getWorldPosition(), _obs.node.getWorldPosition());
                    if (d2 > d1) {
                        _obs = otherObs;
                    }
                }
            }
        }

        if (_otherArrow && _obs) {
            let d1 = Vec3.distance(obs.node.getWorldPosition(), _otherArrow.node.getWorldPosition());
            let d2 = Vec3.distance(obs.node.getWorldPosition(), _obs.node.getWorldPosition());
            if (d1 > d2) {
                return _obs;
            } else {
                return _otherArrow;
            }
        } else if (_obs) {
            return _obs;
        } else if (_otherArrow) {
            return _otherArrow;
        }
        return null;

    }

    /**
     * 查看当前障碍物是否可以移动
     * @param obs 障碍物
     */
    canMoveObsToPoint(obs: Obstacle): Arrow | Obstacle {
        if (!obs) return null;
        let obsArray = Utils.getRotatedVecticesArrow(obs);

        //检测是否碰撞到箭头
        let _otherArrow: Arrow = null;
        for (const otherArrow of this.arrows) {
            if (otherArrow.isOver) continue;
            if (Intersection2D.polygonPolygon(obsArray, Utils.getRotatedVecticesArrow(otherArrow))) {
                _otherArrow = otherArrow;
                break;
            }
        }

        if (_otherArrow) {
            return _otherArrow;
        }

        //检测是否碰撞到障碍物
        let _obs: Obstacle = null;
        for (const otherObs of this.obsAry) {
            if (obs == otherObs) continue; // 跳过自身
            if (otherObs.isOver) continue;
            if (Intersection2D.polygonPolygon(obsArray, Utils.getRotatedVecticesArrow(otherObs))) {
                _obs = otherObs;
                break;
            }
        }
        if (_obs) {
            return _obs;
        }
        return null;
    }

    camMoveObsForgPoint(pos: Vec3): Array<Circle> {
        //当前青蛙所在的圆
        let circle = this.getPointCircle(pos);
        //所有青蛙可以移动的圆点
        let circles = this.getAllFrogCircle();
        let list: Array<Circle> = [];
        for (let i = 0; i < circles.length; i++) {
            let c = circles[i];
            if (c == circle) continue; // 跳过自身
            //获取当前圆点是否与别的矩形由碰撞------ 没有才继续计算
            if (this.getCircleCollisons(c)) {
                continue;
            }

            list.push(c);
        }
        let radius = this.levelData.radius || 30;

        // //使用递归的方式 检测当前点指定方向的圆
        // function checkPointDirCircles(c: Circle) {
        //     let angles = [0, 180, 60, 120, -122, -60];
        //     let ciscles: Circle[] = [];
        //     for (let i = 0; i < angles.length; i++) {
        //         //获取当前角度方向
        //         let dir = Utils.getDirectionFromRotation(angles[i]);
        //         let pos = c.node.getWorldPosition();
        //         const targetPos = new Vec2(
        //             pos.x + dir.x * 200, // 假设移动到足够远的位置
        //             pos.y + dir.y * 200
        //         );


        //         for (let j = 0; j < list.length; j++) {
        //             let nc = list[j];
        //             if (nc == c) continue; // 跳过自身


        //             if (Utils.lineCircle(new math.Vec2(pos.x, pos.y), targetPos, new math.Vec2(nc.node.worldPositionX, nc.node.worldPositionY), radius)) {
        //                 //这里可以移动
        //                 ciscles.push(nc);
        //                 break;
        //             }
        //         }
        //     }
        //     return ciscles;
        // }

        // /**
        // * 递归查找所有可移动路径
        // * @param c 当前圆点
        // * @param list 可移动的圆点集合
        // * @param radius 圆点半径
        // * @param path 当前路径（递归用）
        // * @param visited 已访问集合（递归用）
        // * @returns 所有可移动路径（每条路径为数组）
        // */
        // function findAllMovePaths(
        //     c: Circle,
        //     list: Circle[],
        //     radius: number,
        //     path: Circle[] = [],
        //     visited: Set<number> = new Set(),
        //     depth: number = 0,
        //     maxDepth: number = 10 // 可根据实际情况调整
        // ): Circle[][] {
        //     if (depth > maxDepth) return [];
        //     let angles = [0, 180, 60, 120, -122, -60];
        //     let result: Circle[][] = [];
        //     path.push(c);
        //     visited.add(c.index);

        //     let foundNext = false;
        //     for (let i = 0; i < angles.length; i++) {
        //         let dir = Utils.getDirectionFromRotation(angles[i]);
        //         let pos = c.node.getWorldPosition();
        //         const targetPos = new Vec2(
        //             pos.x + dir.x * 200,
        //             pos.y + dir.y * 200
        //         );

        //         for (let j = 0; j < list.length; j++) {
        //             let nc = list[j];
        //             if (nc == c || visited.has(nc.index)) continue;

        //             if (Utils.lineCircle(new math.Vec2(pos.x, pos.y), targetPos, new math.Vec2(nc.node.worldPositionX, nc.node.worldPositionY), radius)) {
        //                 foundNext = true;
        //                 result.push(...findAllMovePaths(nc, list, radius, path, visited, depth + 1, maxDepth));
        //             }
        //         }
        //     }

        //     if (!foundNext && path.length > 1) {
        //         result.push([...path]);
        //     }

        //     path.pop();
        //     visited.delete(c.index);

        //     return result;
        // }

        // function findAllMovePathsIterative(
        //     start: Circle,
        //     list: Circle[],
        //     radius: number,
        //     maxDepth: number = 15
        // ): Circle[][] {
        //     let angles = [0, 180, 60, 120, -122, -60];
        //     let result: Circle[][] = [];
        //     // 栈元素：{ path, visited }
        //     let stack: { path: Circle[], visited: Set<number> }[] = [
        //         { path: [start], visited: new Set([start.index]) }
        //     ];

        //     while (stack.length > 0) {
        //         let { path, visited } = stack.pop();
        //         let c = path[path.length - 1];
        //         let foundNext = false;

        //         for (let i = 0; i < angles.length; i++) {
        //             let dir = Utils.getDirectionFromRotation(angles[i]);
        //             let pos = c.node.getWorldPosition();
        //             const targetPos = new Vec2(
        //                 pos.x + dir.x * 200,
        //                 pos.y + dir.y * 200
        //             );

        //             for (let j = 0; j < list.length; j++) {
        //                 let nc = list[j];
        //                 if (nc == c || visited.has(nc.index)) continue;

        //                 if (Utils.lineCircle(new math.Vec2(pos.x, pos.y), targetPos, new math.Vec2(nc.node.worldPositionX, nc.node.worldPositionY), radius)) {
        //                     foundNext = true;
        //                     if (path.length < maxDepth) {
        //                         let newPath = [...path, nc];
        //                         let newVisited = new Set(visited);
        //                         newVisited.add(nc.index);
        //                         stack.push({ path: newPath, visited: newVisited });
        //                     }
        //                 }
        //             }
        //         }

        //         if (!foundNext && path.length > 1) {
        //             result.push(path);
        //         }
        //     }
        //     return result;
        // }

        // function findAllMovePathsIterativeLimited(
        //     start: Circle,
        //     list: Circle[],
        //     radius: number,
        //     maxDepth: number = 20,
        //     maxPaths: number = 1000
        // ): Circle[][] {
        //     let angles = [0, 180, 60, 120, -122, -60];
        //     let result: Circle[][] = [];
        //     let stack: { path: Circle[], visited: Set<number> }[] = [
        //         { path: [start], visited: new Set([start.index]) }
        //     ];

        //     while (stack.length > 0 && result.length < maxPaths) {
        //         let { path, visited } = stack.pop();
        //         let c = path[path.length - 1];
        //         let foundNext = false;

        //         for (let i = 0; i < angles.length; i++) {
        //             let dir = Utils.getDirectionFromRotation(angles[i]);
        //             let pos = c.node.getWorldPosition();
        //             const targetPos = new Vec2(
        //                 pos.x + dir.x * 200,
        //                 pos.y + dir.y * 200
        //             );

        //             for (let j = 0; j < list.length; j++) {
        //                 let nc = list[j];
        //                 if (nc == c || visited.has(nc.index)) continue;

        //                 if (Utils.lineCircle(new math.Vec2(pos.x, pos.y), targetPos, new math.Vec2(nc.node.worldPositionX, nc.node.worldPositionY), radius)) {
        //                     foundNext = true;
        //                     if (path.length < maxDepth) {
        //                         let newPath = [...path, nc];
        //                         let newVisited = new Set(visited);
        //                         newVisited.add(nc.index);
        //                         stack.push({ path: newPath, visited: newVisited });
        //                     }
        //                 }
        //             }
        //         }

        //         if (!foundNext && path.length > 1) {
        //             result.push(path);
        //         }
        //     }
        //     return result;
        // }
        // let allPaths = findAllMovePathsIterativeLimited(circle, list, radius);
        //         /**
        //  * 六方向BFS查找所有点的最短路径（每个点只访问一次）
        //  * @param start 起始圆点
        //  * @param list 可达圆点集合
        //  * @param radius 判定半径
        //  * @param maxDepth 最大深度
        //  * @returns Map<点index, 路径数组>
        //  */
        //         function findShortestPathsSixDirections(
        //             start: Circle,
        //             list: Circle[],
        //             radius: number,
        //             maxDepth: number = 20
        //         ): Map<number, Circle[]> {
        //             let angles = [0, 180, 60, 120, -120, -60];
        //             let queue: { path: Circle[] }[] = [{ path: [start] }];
        //             let visited = new Set<number>([start.index]);
        //             let shortestPaths = new Map<number, Circle[]>();
        //             shortestPaths.set(start.index, [start]);

        //             while (queue.length > 0) {
        //                 let { path } = queue.shift();
        //                 let cur = path[path.length - 1];
        //                 if (path.length > maxDepth) continue;

        //                 for (let i = 0; i < angles.length; i++) {
        //                     let dir = Utils.getDirectionFromRotation(angles[i]);
        //                     let pos = cur.node.getWorldPosition();
        //                     const targetPos = new Vec2(
        //                         pos.x + dir.x * 2000,
        //                         pos.y + dir.y * 2000
        //                     );
        //                     let nearest: Circle = null;
        //                     let minDist = Infinity;
        //                     for (let j = 0; j < list.length; j++) {
        //                         let nc = list[j];
        //                         if (nc == cur || visited.has(nc.index)) continue;
        //                         let ncPos = nc.node.getWorldPosition();
        //                         if (Utils.lineCircle(new math.Vec2(pos.x, pos.y), targetPos, new math.Vec2(ncPos.x, ncPos.y), radius)) {
        //                             let dist = Vec3.distance(pos, ncPos);
        //                             if (dist < minDist) {
        //                                 minDist = dist;
        //                                 nearest = nc;
        //                             }
        //                         }
        //                     }
        //                     if (nearest) {
        //                         visited.add(nearest.index);
        //                         let newPath = [...path, nearest];
        //                         shortestPaths.set(nearest.index, newPath);
        //                         queue.push({ path: newPath });
        //                     }
        //                 }
        //             }
        //             return shortestPaths;
        //         }
        //         let allPaths = findShortestPathsSixDirections(circle, list, radius) as any;

        let allPaths = this.spreadReachableCirclesArray(circle, list, radius);
        return allPaths;
    }

    /**
    * 六方向扩散查找所有可达点，返回数组形式的 Circle
    * @param start 起始圆点
    * @param list 可达圆点集合
    * @param radius 判定半径
    * @returns Circle[] 所有可达点
    */
    spreadReachableCirclesArray(
        start: Circle,
        list: Circle[],
        radius: number
    ): Circle[] {
        let angles = [0, 180, 60, 120, -120, -60];
        let visited = new Set<number>();
        let queue: Circle[] = [start];
        visited.add(start.index);

        while (queue.length > 0) {
            let cur = queue.shift();
            let pos = cur.node.getWorldPosition();

            for (let i = 0; i < angles.length; i++) {
                let dir = Utils.getDirectionFromRotation(angles[i]);
                const targetPos = new Vec2(
                    pos.x + dir.x * 200,
                    pos.y + dir.y * 200
                );
                let nearest: Circle = null;
                let minDist = Infinity;
                for (let j = 0; j < list.length; j++) {
                    let nc = list[j];
                    if (nc == cur || visited.has(nc.index)) continue;
                    let ncPos = nc.node.getWorldPosition();
                    if (Utils.lineCircle(new math.Vec2(pos.x, pos.y), targetPos, new math.Vec2(ncPos.x, ncPos.y), radius)) {
                        let dist = Vec3.distance(pos, ncPos);
                        if (dist < minDist) {
                            minDist = dist;
                            nearest = nc;
                        }
                    }
                }
                if (nearest && !visited.has(nearest.index)) {
                    visited.add(nearest.index);
                    queue.push(nearest);
                }
            }
        }
        // 返回所有可达点的 Circle 数组（不含起点）
        return list.filter(c => visited.has(c.index) && c !== start);
    }

    findPathToTarget(pos: Vec3,
        targetIndex: number,
        list: Circle[],
        maxDepth: number = 20) {
        //当前青蛙所在的圆
        let start = this.getPointCircle(pos);
        let angles = [0, 180, 60, 120, -120, -60];
        let queue: { path: Circle[], visited: Set<number> }[] = [
            { path: [start], visited: new Set([start.index]) }
        ];
        let radius = this.levelData.radius || 30;


        while (queue.length > 0) {
            let { path, visited } = queue.shift();
            let cur = path[path.length - 1];
            if (cur.index === targetIndex) {
                return path;
            }
            if (path.length > maxDepth) continue;

            let pos = cur.node.getWorldPosition();
            for (let i = 0; i < angles.length; i++) {
                let dir = Utils.getDirectionFromRotation(angles[i]);
                const targetPos = new Vec2(
                    pos.x + dir.x * 200,
                    pos.y + dir.y * 200
                );
                let nearest: Circle = null;
                let minDist = Infinity;
                for (let j = 0; j < list.length; j++) {
                    let nc = list[j];
                    if (nc == cur || visited.has(nc.index)) continue;
                    let ncPos = nc.node.getWorldPosition();
                    if (Utils.lineCircle(new math.Vec2(pos.x, pos.y), targetPos, new math.Vec2(ncPos.x, ncPos.y), radius)) {
                        let dist = Vec3.distance(pos, ncPos);
                        if (dist < minDist) {
                            minDist = dist;
                            nearest = nc;
                        }
                    }
                }
                if (nearest && !visited.has(nearest.index)) {
                    let newPath = [...path, nearest];
                    let newVisited = new Set(visited);
                    newVisited.add(nearest.index);
                    queue.push({ path: newPath, visited: newVisited });
                }
            }
        }
        return null;
    }


    checkPointDirCircles(point: Vec3, angle: number, fillc: Circle = null, list: Array<Circle> = []) {
        //获取当前角度方向
        let dir = Utils.getDirectionFromRotation(angle);

        const targetPos = new Vec2(
            point.x + dir.x * 1000, // 假设移动到足够远的位置
            point.y + dir.y * 1000
        );
        let radius = this.levelData.radius || 30;

        let circles: Circle[] = list || [];
        for (const circle of this.circles) {
            if (circle == fillc) continue; // 跳过自身

            const circlePos = circle.node.getWorldPosition();
            //计算当前方向的线段与圆点的碰撞



            if (Utils.lineCircle(new math.Vec2(point.x, point.y), targetPos, new math.Vec2(circlePos.x, circlePos.y), radius)) {
                if (this.getCircleCollisons(circle)) {
                    //如果当前圆点上有箭头或者障碍物则跳过
                    continue;
                }
                circles.push(circle);
            }
        }

        return circles;
    }

    //查看当前点对应角度方向上的圆点
    checkPointDirCircle(point: Vec3, angle: number, fillc: Circle = null, first: boolean = false) {
        //获取当前角度方向
        let dir = Utils.getDirectionFromRotation(angle);

        const targetPos = new Vec2(
            point.x + dir.x * 1000, // 假设移动到足够远的位置
            point.y + dir.y * 1000
        );
        let radius = this.levelData.radius || 30;

        let _circle: Circle;
        for (const circle of this.circles) {
            if (circle == fillc) continue; // 跳过自身
            const circlePos = circle.node.getWorldPosition();
            //计算当前方向的线段与圆点的碰撞

            if (Utils.lineCircle(new math.Vec2(point.x, point.y), targetPos, new math.Vec2(circlePos.x, circlePos.y), radius)) {
                if (first) {
                    //查找最近的
                    if (_circle == null) {
                        _circle = circle;
                    } else {
                        let d1 = Vec3.distance(point, _circle.node.getWorldPosition());
                        let d2 = Vec3.distance(point, circlePos);
                        if (d1 > d2) {
                            _circle = circle;
                        }
                    }
                } else {
                    _circle = circle;
                    break;
                }
            }
        }
        return _circle;
    }
    //查看点上是否存在箭头或者障碍物
    checkIsPointArrowOrObs(circle: Circle, f: Arrow | Obstacle): Arrow | Obstacle {
        let radius = this.levelData.radius || 30;

        //查看点上是否存在箭头
        for (const otherArrow of this.arrows) {
            if (otherArrow == f) {
                continue;
            }
            if (otherArrow.isOver) continue;
            let distance = Vec3.distance(circle.node.getWorldPosition(), otherArrow.node.getWorldPosition());
            if (distance < radius) {
                return otherArrow; // 返回碰撞的箭头
            }
        }

        //查看点上是否存在障碍物
        for (const obs of this.obsAry) {
            if (obs == f) {
                continue;
            }
            if (obs.isOver) continue; // 跳过自身
            let distance = Vec3.distance(circle.node.getWorldPosition(), obs.node.getWorldPosition());
            if (distance < radius) {
                return obs; // 返回碰撞的箭头
            }
        }



        return null;
    }

    /**
     * 检查障碍鱼是否可以移动
     * @param fish 障碍鱼
     */
    checkFishMove(fish: ObstacleFish) {
        let point = fish.node.getWorldPosition();

        let dir = Utils.getDirectionFromRotation(fish.node.angle);
        let targetPos = new Vec2(
            point.x + dir.x * 1000, // 假设移动到足够远的位置
            point.y + dir.y * 1000
        );

        let otherFish: ObstacleFish = null;

        //查找和鱼相对应的鱼 鱼头对鱼头的可以移动
        for (const obs of this.obsAry) {
            if (obs == fish) continue; // 跳过自身
            if (obs.isOver) continue; // 跳过自身
            if (obs.node.angle == fish.node.angle) continue; // 角度一致的跳过
            if (Intersection2D.linePolygon(new Vec2(point.x, point.y), targetPos, Utils.getRotatedVecticesArrow(obs))) {
                //如果碰撞到其他障碍物 则不能移动
                if (Math.abs(fish.node.angle) + Math.abs(obs.node.angle) == 180) {
                    if (otherFish == null) {
                        otherFish = obs as ObstacleFish; // 找到对应的鱼
                    } else {
                        //计算距离 获取最短的鱼
                        let d1 = Vec3.distance(point, otherFish.node.getWorldPosition());
                        let d2 = Vec3.distance(point, obs.node.getWorldPosition());
                        if (d1 > d2) {
                            otherFish = obs as ObstacleFish;
                        }
                    }
                    // console.log("可以移动");
                    // break;
                }
            }
        }

        if (otherFish) {
            let distance = Vec3.distance(point, otherFish.node.getWorldPosition());
            targetPos.x = point.x + dir.x * distance;
            targetPos.y = point.y + dir.y * distance;

            let isMove = true;
            //查看当前方向与其他障碍物是否碰撞
            for (const obs of this.obsAry) {
                if (obs == fish || obs == otherFish) continue; // 跳过自身
                if (obs.isOver) continue; // 跳过自身
                if (Intersection2D.linePolygon(new Vec2(point.x, point.y), targetPos, Utils.getRotatedVecticesArrow(obs))) {
                    isMove = false; // 不能移动
                    break;
                }
            }

            if (isMove) {
                //查看当前方向与其他箭头是否碰撞
                for (const arrow of this.arrows) {
                    if (arrow.isOver) continue; // 跳过自身
                    if (Intersection2D.linePolygon(new Vec2(point.x, point.y), targetPos, Utils.getRotatedVecticesArrow(arrow))) {
                        isMove = false; // 不能移动
                        break;
                    }
                }

                //可以移动
                if (isMove) {
                    console.log("可以移动");
                    //计算两条鱼中间点
                    let midPoint = new Vec3(
                        (point.x + otherFish.node.getWorldPosition().x) / 2,
                        (point.y + otherFish.node.getWorldPosition().y) / 2
                    );
                    let p = midPoint.clone();
                    //分别将两条鱼移动到中间点
                    fish.moveToPoint(midPoint, () => {
                        this.playHurtEffect(p);
                    });
                    otherFish.moveToPoint(midPoint, () => {

                    });

                } else {
                    console.log("碰撞到箭头");
                }
            } else {
                console.log("碰撞到障碍物");
            }
        }

    }

    playHurtEffect(pos: Vec3) {
        resources.load("prefabs/EffectHurt", Prefab, (err, prefab) => {
            if (err) {
                console.error(err);
                return;
            }
            let hurtEffect = instantiate(prefab);
            this.dir.addChild(hurtEffect);
            hurtEffect.setWorldPosition(pos);
        });
    }

    checkIsPut(arrow: Arrow, circle: Circle) {
        let angle = Utils.calculateTouchAngle(circle.node.getWorldPosition(), arrow.node.getWorldPosition());
        let otherArrow = Engine.instance.canMoveTowardsHighlightedCircle(arrow, angle, false);

        if (!otherArrow) {
            //没有圆点可以拦住---
            //检测当前方向线段是否有碰撞到箭头
            otherArrow = Engine.instance.canMoveTowardArrow(arrow, circle);
            if (!otherArrow) {
                return otherArrow;
            }
        }
        return otherArrow;
    }

    showMask(ismask: boolean, msg: string = "") {
        this.mask.active = true;
        this.mask.children[0].active = ismask;
        this.mask.children[1].active = ismask;
        if (msg != "") {
            this.mask.children[1].getComponent(Label).string = msg;
        }
    }

    hideMask() {
        this.mask.active = false;
    }

    checkIsGameOVer() {
        if (this.isGameOver) return;
        let isOver = true;
        for (const arrow of this.arrows) {
            if (!arrow.isOver) {
                isOver = false;
                break;
            }
        }

        for (const obs of this.obsAry) {
            if (obs instanceof ObstacleFish && !obs.isOver) {
                isOver = false;
                break;
            }
        }

        if (isOver) {
            this.isGameOver = true;
            console.log("游戏结束  引导数据");
            console.log(JSON.stringify(this.guides));



            // //查看当前关卡是否大于等于当前最大关卡
            if (this.curLevel >= GlobalConfig.DB.level) {

                //更新最大关卡
                localStorage.setItem('curLevel', (this.curLevel + 1).toString());
                Engine.instance.jsb.completeLevel(this.curLevel, GlobalConfig.maxLevel);
                // this.showLottery();
                this.showWin();

            } else {
                this.showWin();
            }

        }
    }

    clearAllArrow() {
        for (let i = 0; i < this.arrows.length; i++) {
            this.arrows[i].clear();
        }
        this.arrows = [];
    }

    clearAllCircle() {
        for (let i = 0; i < this.circles.length; i++) {
            this.circles[i].clear();
        }
        this.circles = [];
    }

    clearAllObs() {
        for (let i = 0; i < this.obsAry.length; i++) {
            this.obsAry[i].node.destroy();
        }
        this.obsAry = [];
    }

    hideAllCircle() {
        for (let i = 0; i < this.circles.length; i++) {
            this.circles[i].removeHighlight();
        }
    }

    hideAllFrog() {
        for (let i = 0; i < this.obsAry.length; i++) {
            this.obsAry[i].playIdle();
        }
    }

    nextLevel() {
        this.clearAllArrow();
        this.clearAllCircle();
        this.clearAllObs();

        let l = this.curLevel + 1;
        if (l >= GlobalConfig.maxLevel) {
            l = GlobalConfig.maxLevel;
        }
        this.curLevel = l;

        this.showMask(true);
        this.refreshLevelLabel();

        setTimeout(() => {
            this.generateLevel(this.curLevel);
        }, 1);
    }

    startLevel() {
        if (isNet == false) {
            if (this.toggle.isChecked == false) {
                if (sys.platform == sys.Platform.ANDROID) {
                    yr.inst.showToast("请阅读并同意《用户协议》与《隐私政策》");
                } else {
                    alert("请阅读并同意《用户协议》与《隐私政策》");
                }
                return;
            }
        } else {

        }

        this.onStartLevel(GlobalConfig.DB.level);
    }

    refreshLevel() {
        this.clearAllArrow();
        this.clearAllCircle();
        this.clearAllObs();
        this.onStartLevel(this.curLevel);
    }

    onStartLevel(l: number) {
        this.curLevel = l;
        this.loadLevelData(this.curLevel);
        this.uimain.active = false;
        this.uigame.active = true;
    }

    onSettingClick() {
        this.setting.show(false);
    }

    onGameSettingClick() {
        this.setting.show(true);
    }

    onSelectLevelClick() {
        let l = this.getComponentInChildren(UISelectLevel);
        l.show();
    }

    onExitClick() {
        this.clearAllArrow();
        this.clearAllCircle();
        this.clearAllObs();

        this.uigame.active = false;
        this.uimain.active = true;

        Engine.instance.jsb.Jsb.showInstertView('');
    }

    changeMusic(s: boolean) {
        // if (s) {
        //     //播放音效
        // } else {
        //     //停止音效
        // }
        //获取本地的值
        let key = localStorage.getItem('music');
        if (key && key != "") {
            let flag = parseInt(key) == 1;
            if (flag) {
                // this.musicSource.play();
                this.playMusic();
            } else {
                this.musicSource.stop();
            }
        }
    }

    playMusic() {
        let key = localStorage.getItem('music');
        if (key && key != "") {
            let flag = parseInt(key) == 1;
            if (flag) {
                resources.load('audio/bgm', AudioClip, (err, clip) => {
                    if (err) return;
                    let key = localStorage.getItem('music');
                    if (key && key != "") {
                        let flag = parseInt(key) == 1;
                        if (!flag) {
                            this.musicSource.stop();
                            return;
                        }
                    }

                    this.musicSource.clip = clip;
                    this.musicSource.play();
                });
            } else {
                this.musicSource.stop();
            }
        } else {
            resources.load('audio/bgm', AudioClip, (err, clip) => {
                if (err) return;
                let key = localStorage.getItem('music');
                if (key && key != "") {
                    let flag = parseInt(key) == 1;
                    if (!flag) {
                        this.musicSource.stop();
                        return;
                    }
                }

                this.musicSource.clip = clip;
                this.musicSource.play();
            });
        }
    }

    playSound(sound: string) {
        let key = localStorage.getItem('sound');
        if (key && key != "") {
            let flag = parseInt(key) == 1;
            if (flag) {
                resources.load("audio/" + sound, AudioClip, (err, clip) => {
                    if (err) return;
                    this.musicSource.playOneShot(clip);
                });
            }
        } else {
            resources.load("audio/" + sound, AudioClip, (err, clip) => {
                if (err) return;
                this.musicSource.playOneShot(clip);
            });
        }
    }

    playShake() {
        let key = localStorage.getItem('shake');
        if (key && key != "") {
            let flag = parseInt(key) == 1;
            if (flag) {
                Engine.instance.jsb.Jsb.openVibrateShort();
            }
        } else {
            Engine.instance.jsb.Jsb.openVibrateShort();
        }
    }

    onFriendClick() {
        resources.load('prefabs/UIFriend', Prefab, (err, fab) => {
            if (err) {
                return;
            }

            this.node.addChild(instantiate(fab));
        })
    }

    changeAdVisible(v: boolean) {
        for (let i = 0; i < this.adNodes.length; i++) {
            this.adNodes[i].active = v;
        }
    }

    showTipNode(pos: Vec3) {
        Tween.stopAllByTarget(this.tipNode);
        this.tipNode.active = true;
        this.tipNode.setWorldPosition(pos);
        // tween(this.tipNode).delay(2).call(() => {
        //     this.tipNode.active = false;
        // })
        setTimeout(() => {
            this.tipNode.active = false;
        }, 2000);
    }

    getAllFrogCircle() {
        // if (this.frogCircles.length > 0) {
        //     return this.frogCircles;
        // }
        // for (let i = 0; i < this.circles.length; i++) {
        //     let circle = this.circles[i];
        //     if (this.circles.length == 95) {
        //         if ((circle.index + 1) % 3 == 0) {
        //             this.frogCircles.push(circle);
        //         }
        //     } else if (this.circles.length == 149) {
        //         if ((circle.index) % 3 == 0) {
        //             this.frogCircles.push(circle);
        //         }
        //     }
        // }

        // return this.frogCircles;
        return this.circles;
    }

    // isClickClear: boolean = false;
    isTip: boolean = false;
    onHelpClick() {
        //播放广告-----
        // this.isClickClear = true;
        this.changeAdVisible(true);
    }

    onCheckClick() {

        this.jsb.playRewardVideo("", null).then((code: SwitchType) => {
            if (code == SwitchType.On) {
                if (!this.isTip) {
                    this.isTip = true;
                    // let datas = [];


                    //获取当前关卡引导索引表中 最靠前的箭头
                    for (let i = 0; i < this.curGuideData.length; i++) {
                        let guideData = this.curGuideData[i];
                        if (guideData[2] == 'obs') {
                            //属于障碍物
                            let obsid = guideData[0];
                            let obs = this.obsAry.find((o) => o.index == obsid);
                            if (obs == null) {
                                continue;
                            }
                            if (obs.isOver) {
                                continue;
                            }
                            //let angle = guideData[1];
                            resources.load('prefabs/' + guideData[3], Prefab, (err, fab) => {
                                if (err) {
                                    return;
                                }
                                let obsNode = instantiate(fab);
                                obsNode.setPosition(obs.node.getPosition());
                                this.dir.addChild(obsNode);
                                obsNode.angle = guideData[1];
                                //计算当前角度对应的方向
                                let direction = Utils.getDirectionFromRotation(guideData[1]);
                                let to = direction.normalize().multiplyScalar(300);
                                tween(obsNode).to(1, {
                                    position: to.add(obsNode.position)
                                }).call(() => {
                                    obsNode.position = obs.node.getPosition()
                                }).union().repeatForever().start();
                                obsNode.name = 'guideArrow';
                            });
                            this.showAdTipPlane(obs.node.getWorldPosition());
                            break;
                        } else {
                            let arrowid = guideData[0];
                            let circleid = guideData[1];
                            let arrow = this.arrows.find((a) => a.circleId == arrowid);
                            if (arrow == null) {
                                continue;
                            }

                            if (arrow.isOver) {
                                continue;
                            }
                            if (arrow) {
                                let circle = this.circles.find((c) => c.index == circleid);

                                let angle = Utils.calculateTouchAngle(circle.node.getWorldPosition(), arrow.node.getWorldPosition());

                                let newArrow = this.createArrow(arrow.circleId, angle, arrow.width, false);
                                //移除newArrow节点上所有点击事件

                                newArrow.node.addComponent(UIOpacity).opacity = 255 * 0.5;
                                newArrow.node.name = 'guideArrow';
                                let pos = arrow.node.getPosition();

                                newArrow.node.angle = angle;

                                console.log(angle);
                                //计算当前角度对应的方向
                                let direction = Utils.getDirectionFromRotation(angle);
                                let to = direction.normalize().multiplyScalar(300);
                                tween(newArrow.node).to(1, {
                                    position: to.add(newArrow.node.position)
                                }).call(() => {
                                    newArrow.node.position = pos;
                                }).union().repeatForever().start();

                                arrow.changeSpColor(2);

                                this.showAdTipPlane(arrow.touSp.node.getWorldPosition());
                                break;
                            }
                        }
                    }

                    // this.btnTipLabel.string = '移除';
                    this.btnTip.active = false;
                    this.btnRemove.active = true;
                } else {
                    //移除当前的箭头
                    //获取当前关卡引导索引表中 最靠前的箭头
                    for (let i = 0; i < this.curGuideData.length; i++) {
                        let guideData = this.curGuideData[i];
                        if (guideData[2] == 'obs') {
                            //属于障碍物
                            let obsid = guideData[0];
                            let obs = this.obsAry.find((o) => o.index == obsid);
                            if (obs == null) {
                                continue;
                            }
                            if (obs.isOver) {
                                continue;
                            }
                            obs.node.angle = guideData[1];
                            obs.move();
                            break;
                        } else {
                            let arrowid = guideData[0];
                            let circleid = guideData[1];
                            let arrow = this.arrows.find((a) => a.circleId == arrowid);
                            if (arrow == null) {
                                continue;
                            }
                            if (arrow.isOver) {
                                continue;
                            }
                            let circle = this.circles.find((c) => c.index == circleid);

                            let angle = Utils.calculateTouchAngle(circle.node.getWorldPosition(), arrow.node.getWorldPosition());
                            arrow.node.angle = angle;
                            arrow.move(null);
                            break;
                        }
                    }

                    this.clearArrowTip();
                }
            }
        })
    }

    showAdTipPlane(pos: Vec3) {
        this.adTipPlane.active = true;
        this.adTipPlane.setWorldPosition(pos.add3f(0, 50, 0));
        setTimeout(() => {
            this.adTipPlane.active = false;
        }, 3000);
    }

    clearArrowTip() {
        this.isTip = false;
        this.btnTip.active = true;
        this.btnRemove.active = false;
        // this.btnTipLabel.string = '提示';
        for (let i = 0; i < this.arrows.length; i++) {
            this.arrows[i].changeSpColor(0);
        }

        this.hideAllCircle();
        let arrow = this.dir.getChildByName('guideArrow');
        if (arrow) {
            arrow.destroy();
        }
        // this.changeAdVisible(false);
    }

    onPutRecord(arrow: Arrow) {
        this.records.push(arrow);
        if (arrow) {
            if (arrow.moveCircle) {
                this.guides.push([
                    arrow.circleId,
                    arrow.moveCircle.index
                ])
            } else {
                console.log("记录错误")
            }
        }
        // console.log("记录当前的箭头", arrow.circleId, arrow.node.angle);

        // console.log(JSON.stringify(this.guides));

    }

    onPutRecordObs(obs: Obstacle) {
        this.records.push(obs);

        this.guides.push([
            //位置索引
            obs.index,
            //障碍物旋转角度
            obs.node.angle,
            //类型
            'obs',
            obs.node.name
        ])

        // console.log(JSON.stringify(this.guides));

    }

    addCoin(coin: number) {

        GlobalConfig.DB.coin += coin;
        SqlUtil.set('coin', GlobalConfig.DB.coin);
    }

    saveDB() {
    }

    showLottery() {
        console.log("showLottery")
        resources.load('prefabs/UILottery', Prefab, (err, prefab) => {
            if (err) return;
            let node = instantiate(prefab)
            this.node.addChild(node);

        });
    }

    showWin() {
        resources.load('prefabs/UIWin', Prefab, (err, prefab) => {
            if (err) return;
            let node = instantiate(prefab)
            this.node.addChild(node);
            let win = node.getComponent(UIWin);
            win.show();
        });
    }


    static OneDay = 1000 * 60 * 60 * 24;

    /**
     * 计算天数间隔  比如2022年11月22日20时10分和2022年11月23日01时是算一个间隔天
     * @param d1 
     * @param d2 
     */
    static DaysDiff(d1: number, d2: number) {
        let t1 = new Date(d1);
        let t2 = new Date(d2);
        t1.setHours(0, 0, 0, 0);
        t2.setHours(0, 0, 0, 0);


        // 计算时间差
        const timeDiff = Math.abs(t1.getTime() - t2.getTime());

        return Math.ceil(timeDiff / this.OneDay)
    }

    protected update(dt: number): void {
        if (!this.isGameOver) {
            if (this.curLevel > 2) {
                this.countDown -= dt;
                if (this.countDown <= 0) {
                    this.countDown = 0;
                    this.isGameOver = true;
                    resources.load('prefabs/UITimeOut', Prefab, (err, fab) => {
                        if (err) {
                            console.error(err);
                            return;
                        }
                        const gameOverNode = instantiate(fab);
                        this.node.addChild(gameOverNode);
                    });
                }
                //将倒计时秒转换为00:00格式
                let minutes = Math.floor(this.countDown / 60);
                let seconds = Math.floor(this.countDown % 60);
                this.timeLabel.string = (minutes < 10 ? '0' + minutes : minutes) + ':' + (seconds < 10 ? '0' + seconds : seconds);
            }
        }
    }

    /**
   * 复活
   */
    revive() {
        this.isGameOver = false;
        this.countDown = 300;
    }

}

